c-compendium/c-compendium.org
#+Title: ORG MODE TEMPLATE
#+Author: Anrich Tait
#+OPTIONS: title:nil  toc:nil
#+LaTeX_CLASS_OPTIONS: [a4paper]

#+BEGIN_EXPORT latex
%\documentclass[a4paper, 11pt]{book} % A4 paper size and default 11pt font size

\newcommand*{\plogo}{\fbox{$\mathcal{PL}$}} % Generic dummy publisher logo

%\usepackage[utf8]{inputenc} % Required for inputting international characters
%\usepackage[T1]{fontenc} % Output font encoding for international characters
%\usepackage{stix} % Use the STIX fonts



%----------------------------------------------------------------------------------------
%	TITLE PAGE
%----------------------------------------------------------------------------------------

\begin{titlepage} % Suppresses displaying the page number on the title page and the subsequent page counts as page 1
	
	\raggedleft % Right align the title page
	
	\rule{1pt}{\textheight} % Vertical line
	\hspace{0.05\textwidth} % Whitespace between the vertical line and title page text
	\parbox[b]{0.75\textwidth}{ % Paragraph box for holding the title page text, adjust the width to move the title page left or right on the page
		
		{\Huge\bfseries C Programming \\[0.5\baselineskip] Language}\\[2\baselineskip] % Title
		{\large\textit{Compendium }}\\[4\baselineskip] % Subtitle or further description
		{\Large\textsc{anrich tait}} % Author name, lower case for consistent small caps
		
		\vspace{0.5\textheight} % Whitespace between the title block and the publisher
		
		{\noindent Written 2023}\\[\baselineskip] % Publisher and logo
	}


\end{titlepage}
%----------------------------------------------------------------------------------------

\tableofcontents
\newpage

#+END_EXPORT

* TODO Introduction


** Example Template:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    printf("This is a template!");
  }
  #+END_SRC
Output: 
  #+RESULTS:
  : This is a template!
-----
\clearpage
* Output (printf):
To output values or print text in c, you can use the *printf()* function.
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    printf("hello, world");
  }
  #+END_SRC
*Output:*
  #+RESULTS:
  : hello, world
-----

There is no limit to the amount of one function you can put in a program. In the
case of the printf function keep in mind that using multiple *printf()*
functions will not ouput a new line. See below:
-----

#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    printf("hello, world");
    printf("I am learning C!");
  }
  #+END_SRC
*Output:*
  #+RESULTS:
  : hello, worldI am learning C!
-----
\clearpage
* Basic escape sequences:
Escape sequences are used to do various things, like adding new lines and adding
characters that the compiler would normally conflict with. See below:
|-----------------+-----------------------------------|
| ESCAPE SEQUENCE | DESCRIPTION                       |
|-----------------+-----------------------------------|
| \t              | Creates a horizontal tab          |
| \\              | Inserts a backslash character (\) |
| \"              | Inserts a double quote character  |
|-----------------+-----------------------------------|

** Insert a new line:
To insert a new line we need to use the *\n* character. 
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    printf("hello, world \n");
    printf("I am learning C! \n");

    // You can also use \n characters to create blank lines:
    printf("Do you see? \n\n");
    printf("YES/NO");
  }
  #+END_SRC
Output:
  #+RESULTS:
  : hello, world 
  : I am learning C! 
  : Do you see? 
  : 
  : YES/NO
-----
\clearpage
* Comments:
Comments are used to explain code and make it more readable. It is also a good
way to make sure the compiler doesn't execute a block of code when you are
testing changes.
Comments can be single-lined or multi-lined.
** Single-lined comments:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    printf("This is an example of a single line comment.");
  //  printf("I hope this doesn't get executed.");
  }
  #+END_SRC
*Output:*
  #+RESULTS:
  : This is an example of a single line comment.
-----

** Multi-lined comments:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    printf("This is an example of a multi-lined comment.");
    /*
      printf("This won't be executed.") <-- No syntax errors in comments
      printf("Found a bug? Maybe just comment the code out.");
      ,*/
  }
  #+END_SRC
*Output:*
  #+RESULTS:
  : This is an example of a multi-lined comment.
-----
\clearpage
* Data types:
Data types in c refer to an extensive system used for declaring variables or
functions of different types.
The type of a variable determines how much space it occupies in storage and how
the bit pattern stored is interpreted.

The different C data types are classified as follows:
| /                | <                                                           |
|------------------+-------------------------------------------------------------|
| TYPE             | DESCRIPTION                                                 |
|------------------+-------------------------------------------------------------|
| Basic types      | Arithmetic types that are further classified into:          |
|                  | a: Integer types                                            |
|                  | b: Floating-point numbers                                   |
|------------------+-------------------------------------------------------------|
| Enumerated types | Arithmetic types that are used to define variables that can |
|                  | only assign certain discrete integer values throughout the  |
|                  | program                                                     |
|------------------+-------------------------------------------------------------|
| Void type        | Indicates that no value is available                        |
|------------------+-------------------------------------------------------------|
| Derived types    | They include:                                               |
|                  | a: Pointer types                                            |
|                  | b: Array types                                              |
|                  | c: Structure types                                          |
|                  | d: Union types                                              |
|                  | e: Function types                                           |
|------------------+-------------------------------------------------------------|

The array types and structur etypes are reffered collectively as the aggregate
types. The type of a function specifies the type of the functions return
value. See the basic types in the following sections.

