temp/c-compendium.tex
% Created 2023-03-03 Fri 07:05
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Anrich Tait}
\date{\today}
\title{ORG MODE TEMPLATE}
\hypersetup{
 pdfauthor={Anrich Tait},
 pdftitle={ORG MODE TEMPLATE},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\section{Template stuff:}
\label{sec:org82ddd03}
%\documentclass[a4paper, 11pt]{book} % A4 paper size and default 11pt font size

\newcommand*{\plogo}{\fbox{$\mathcal{PL}$}} % Generic dummy publisher logo

%\usepackage[utf8]{inputenc} % Required for inputting international characters
%\usepackage[T1]{fontenc} % Output font encoding for international characters
%\usepackage{stix} % Use the STIX fonts



%----------------------------------------------------------------------------------------
%	TITLE PAGE
%----------------------------------------------------------------------------------------

\begin{titlepage} % Suppresses displaying the page number on the title page and the subsequent page counts as page 1
	
	\raggedleft % Right align the title page
	
	\rule{1pt}{\textheight} % Vertical line
	\hspace{0.05\textwidth} % Whitespace between the vertical line and title page text
	\parbox[b]{0.75\textwidth}{ % Paragraph box for holding the title page text, adjust the width to move the title page left or right on the page
		
		{\Huge\bfseries C Programming \\[0.5\baselineskip] Language}\\[2\baselineskip] % Title
		{\large\textit{Compendium }}\\[4\baselineskip] % Subtitle or further description
		{\Large\textsc{anrich tait}} % Author name, lower case for consistent small caps
		
		\vspace{0.5\textheight} % Whitespace between the title block and the publisher
		
		{\noindent Written 2023}\\[\baselineskip] % Publisher and logo
	}


\end{titlepage}
%----------------------------------------------------------------------------------------

\tableofcontents
\newpage

\section{{\bfseries\sffamily TODO} Introduction}
\label{sec:orga103549}


\subsection{Example Template:}
\label{sec:org7814c2b}
\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  printf("This is a template!");
}
\end{verbatim}
Output: 
\begin{verbatim}
This is a template!
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\clearpage
\section{Output (printf):}
\label{sec:org4546fd9}
To output values or print text in c, you can use the \textbf{printf()} function.

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  printf("hello, world");
}
\end{verbatim}
\textbf{Output:}
\begin{verbatim}
hello, world
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

There is no limit to the amount of one function you can put in a program. In the
case of the printf function keep in mind that using multiple \textbf{printf()}
functions will not ouput a new line. See below:

\noindent\rule{\textwidth}{0.5pt}

\begin{verbatim}
#include <stdio.h>

int main(){
  printf("hello, world");
  printf("I am learning C!");
}
\end{verbatim}
\textbf{Output:}
\begin{verbatim}
hello, worldI am learning C!
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\clearpage
\section{Basic escape sequences:}
\label{sec:orgdcfeb34}
Escape sequences are used to do various things, like adding new lines and adding
characters that the compiler would normally conflict with. See below:
\begin{center}
\begin{tabular}{ll}
\hline
ESCAPE SEQUENCE & DESCRIPTION\\
\hline
\t & Creates a horizontal tab\\
$\backslash$\ & Inserts a backslash character ($\backslash$)\\
$\backslash$" & Inserts a double quote character\\
\hline
\end{tabular}
\end{center}

\subsection{Insert a new line:}
\label{sec:org50c3aa3}
To insert a new line we need to use the \textbf{\n} character. 

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  printf("hello, world \n");
  printf("I am learning C! \n");

  // You can also use \n characters to create blank lines:
  printf("Do you see? \n\n");
  printf("YES/NO");
}
\end{verbatim}
Output:
\begin{verbatim}
hello, world 
I am learning C! 
Do you see? 

YES/NO
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\clearpage
\section{Comments:}
\label{sec:org0217a54}
Comments are used to explain code and make it more readable. It is also a good
way to make sure the compiler doesn't execute a block of code when you are
testing changes.
Comments can be single-lined or multi-lined.
\subsection{Single-lined comments:}
\label{sec:orgd24f437}
\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  printf("This is an example of a single line comment.");
//  printf("I hope this doesn't get executed.");
}
\end{verbatim}
\textbf{Output:}
\begin{verbatim}
This is an example of a single line comment.
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Multi-lined comments:}
\label{sec:org24591a0}
\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  printf("This is an example of a multi-lined comment.");
  /*
    printf("This won't be executed.") <-- No syntax errors in comments
    printf("Found a bug? Maybe just comment the code out.");
    */
}
\end{verbatim}
\textbf{Output:}
\begin{verbatim}
This is an example of a multi-lined comment.
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\clearpage
\section{Data types:}
\label{sec:orgdb286d2}
Data types in c refer to an extensive system used for declaring variables or
functions of different types.
The type of a variable determines how much space it occupies in storage and how
the bit pattern stored is interpreted.

The different C data types are classified as follows:
\begin{center}
\begin{tabular}{l|l}
\hline
TYPE & DESCRIPTION\\
\hline
Basic types & Arithmetic types that are further classified into:\\
 & a: Integer types\\
 & b: Floating-point numbers\\
\hline
Enumerated types & Arithmetic types that are used to define variables that can\\
 & only assign certain discrete integer values throughout the\\
 & program\\
\hline
Void type & Indicates that no value is available\\
\hline
Derived types & They include:\\
 & a: Pointer types\\
 & b: Array types\\
 & c: Structure types\\
 & d: Union types\\
 & e: Function types\\
\hline
\end{tabular}
\end{center}

The array types and structur etypes are reffered collectively as the aggregate
types. The type of a function specifies the type of the functions return
value. See the basic types in the following sections.
