temp/c-compendium.tex

\subsection{Basic Data types (quick reference):}
\label{sec:orgd5c8019}
In the following sub-sections detailed descriptions and uses for each data type
are given. The table below is a quick reference for all the basic types and
their format specifiers:
\begin{center}
\begin{tabular}{l|l|l}
\hline
DATA TYPE & DESCRIPTION & FORMAT SPECIFIER\\
\hline
int & Stores whole numbers without decimals & \%d or \%i\\
\hline
 & Stores fractional numbers, containing one or & \\
float & more decimals. Sufficient for storing 6-7 & \%f\\
 & decimal digits. & \\
\hline
 & Stores fractional numbers, containing one or & \\
double & more decimals. Sufficient for storing 15 & \%lf\\
 & decimal digits. & \\
\hline
char & Stores a single character/letter/number or & \%c\\
 & ASCII value & \\
\hline
string & Stores two ore more characters & \%s\\
\hline
\end{tabular}
\end{center}
\subsection{Set decimal precision:}
\label{sec:orgba0b31b}
If you print a floating point number it will output many digits after the
decimal point. If you want to remove the extra decimals (set decimal
precision), you can use a dot (.) followed by a number that specifies how many
digits that should be shown after the decimal point:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  float myFloat = 3.5; 
  printf("%f\n", myFloat); //Will show 6 digits after decimal point.
  printf("%.1f\n", myFloat); // Only show 1 digit.
  printf("%.2f\n", myFloat); //Only show 2 digits.
  printf("%.4f", myFloat); //Only show 4 digits.
}
\end{verbatim}
Output:
\begin{verbatim}
3.500000
3.5
3.50
3.5000
\end{verbatim}


\noindent\rule{\textwidth}{0.5pt}

\subsection{Type conversion:}
\label{sec:org2d09c87}
Sometimes you have to convert the value of one data type to another. This is
known as type conversion:
For example if you divide two integers, 5 and 2. You would expect the result to
be 2.5 but since they are integers (and not floating-point) numbers the output
will be 2.

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int x = 5;
  int y = 2;
  int sum = 5 / 2;

  printf("%d", sum); // outputs 2
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
2
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

To get the right result, you need to know how type conversion works.

There are two types of conversion in C:
\begin{itemize}
\item Implicit Conversion (automatically)
\item Explicity Conversion (manually)
\end{itemize}

\subsubsection{Implicit Conversion:}
\label{sec:org0cfaf6c}
Implicit conversion is done automatically by the compiler when you assign a
value of one type to another.
For example if you assign int to a float type:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  // Automatic conversion: int to float
  float myFloat = 9;

  printf("%f", myFloat);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
9.0
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

As you can see the compiler automatically converts the int value 9 to a float
value 9.0.
This may be risky due to you losing control over specific values in certain
situations.
Especially when it is the other way around - the following example automatically
converts the float value 9.99 to an int value of 9:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  // automatic conversion: float to int
  int myInt = 9.99;
  printf("%d", myInt);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
9
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
See how the output is just 9. For some programs that extra .99 may be necessary
(most likley it is).

As another example, if you divide two integers: 5 by 2, you know the sum result
should be 2.5. Like previously mentioned if you store the sum as an integer, the
result will only display the number 2, therefore it would be better to store the
sum as a float or a double (right?).

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  float sum = 5 / 2;
  printf("%f", sum);
}
\end{verbatim}
Output:
\begin{verbatim}
2.0
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
As you can see the result is 2.0 not 2.5. This is because 5 and 2 are still
integers in the division. In this case you will need to manually convert the
integer values to floating-point values.
For the we use Explicit Conversion.

\subsubsection{Explicit Conversion:}
\label{sec:org24a5b9a}
Explicit conversion is done manually by placing the type in parentheses () in
front of the value.

Considering our problem from the example above, we can now get the right result:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  //manual conversion: int to float
  float sum = (float) 5 / 2;
  printf("%f", sum); //2.5
}
\end{verbatim}
Output:
\begin{verbatim}
2.5
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
You can also place the type in front of the variable:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int num1 = 5;
  int num2 = 2;
  float sum = (float) num1 / num2;

  printf("%f", sum); //2.5
}
\end{verbatim}
Output:
\begin{verbatim}
2.5
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Integer Types:}
\label{sec:org1307964}
The following table provides the details of standard integer tyoes with their
storage size and value ranges:
\begin{center}
\begin{tabular}{l|l|l}
\hline
TYPE & STORAGE SIZE & VALUE RANGE\\
\hline
char & 1 byte & -128 to 127 or 0 to 225\\
\hline
unsigned char & 1 byte & 0 to 255\\
\hline
signed char & 1 byte & -128 to 127\\
\hline
int & 2 or 4 bytes & -32,768 to 32,768 or -2,147,483,648\\
 &  & to 2,147,483,647\\
\hline
unsigned it & 2 or 4 bytes & 0 to 65,535 or 0 to 4,294,967,295\\
\hline
short & 2 bytes & -32,768 to 32,767\\
\hline
unsigned short & 2 bytes & 0 to 65,535\\
\hline
long & 8 bytes or & -9223372036854775808 to 9223372036854775807\\
 & (4bytes for 32 & \\
 & bit OS) & \\
\hline
unsigned long & 8 bytes & 0 to 18446744073709551615\\
\hline
\end{tabular}
\end{center}

\subsection{Floating-point numbers:}
\label{sec:org4c1d766}
The following table provides the details of standard floating-point numbers with
storage sizes and value ranges and their precision:
\begin{center}
\begin{tabular}{l|l|l|l}
\hline
TYPE & STORAGE SIZE & VALUE RANGE & PRECISION\\
\hline
float & 4 bytes & 1.2E-38 to 3.4E+38 & 6 decimal places\\
\hline
double & 8 bytes & 2.3E-308 to 1.7E+308 & 15 decimal places\\
\hline
long double & 10 bytes & 3.4E-4932 to 1.1E+4932 & 19 decimal places\\
\hline
\end{tabular}
\end{center}

The header file <float.h> defines macros that allow you to use these values and
other details about the binary representation of real numbers in your programs.

\clearpage
