c-compendium/c-compendium.org
** Void Types:
The void type specifies that no value is availabe. It is used in three
situtations:
| /                          | <                                                      |
|----------------------------+--------------------------------------------------------|
| TYPE                       | DESCRIPTION / USE                                      |
|----------------------------+--------------------------------------------------------|
| Functions returns as void  | There are various functions in C which do not return   |
|                            | any value or you can say they return void. A function  |
|                            | with no return value has the return type as void.      |
|                            | For example: *void exit(int status);*                  |
|----------------------------+--------------------------------------------------------|
| Function arguments as void | There are various functions in C which do  not accept  |
|                            | any parameter. A function with no parameter can accept |
|                            | a void.                                                |
|                            | For example: *int rand(void);*                         |
|----------------------------+--------------------------------------------------------|
| Pointers to void           | A pointer of type void * represents the address of an  |
|                            | object, but not it's type.                             |
|                            | For example: a memory allocation function              |
|                            | void *malloc( size_t size);                            |
|                            | returns a pointer to void which can be casted to any   |
|                            | data type.                                             |
|----------------------------+--------------------------------------------------------|

** Derived types:
The derived data types are basically derived out of the fundamental datatypes. A
derived data type won’t typically create a new data type – but would add various
new functionalities to the existing ones instead.

We can derive the derived data types out of the primitive data type by adding
some extra relationships to the elements that are available with the primitive
data types. We use the derived data types to represent multiple values as well
as single values in a program.

Below are the types of derived data types and their uses:
| /          | <                                                                              |
|------------+--------------------------------------------------------------------------------|
| TYPE       | DECRIPTION / USE                                                               |
|------------+--------------------------------------------------------------------------------|
| arrays     | refers to a sequence (ordered sequence) of a finite number of data items from  |
|            | the same data type sharing one common name                                     |
|------------+--------------------------------------------------------------------------------|
| function   | refers to a self-contained block of single or multiple statements. It has it's |
|            | own specified name.                                                            |
|------------+--------------------------------------------------------------------------------|
| pointers   | refers to a some special form of variables that one can use for holding        |
|            | other variables' addresses.                                                    |
|------------+--------------------------------------------------------------------------------|
| structures | A collection of various different types of data type items that get stored in  |
|            | a contagious type of memory allocation is known as structure in C.             |
|------------+--------------------------------------------------------------------------------|

\clearpage
* Variables:
Variables are containers for storing data values, like numbers and
characters. Like mentioned previously there are different *data types* in
C. These data types are used to declare variable types.

** Syntax:
To create a variable specify the type and assign it a value.
|----------+--------------+---+--------|
| type     | variableName | = | value; |
|----------+--------------+---+--------|
| Example: |              |   |        |
| int      | myNum        | = | 32;    |
|----------+--------------+---+--------|
The above example will create an integer variable called myNum with the value
of 15.

You can also declare a variable without assigning the value and assign it
later.
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myNum; //declare the variable

    myNum = 32; //assign a value to it
  }
  #+END_SRC
-----

** Output variables:
To output variables in C you must use "format specifiers":
These are used together with the *printf()* function to tell the compiler what
data type the variable is.
A format specifier starts with the *%* sign followed by a character.
The most common format specifiers are listed below:
| /                 | <                                  |
|-------------------+------------------------------------|
| Format specifiers | Type of output                     |
|-------------------+------------------------------------|
| %d or %i          | A decimal inter or signed integer  |
|-------------------+------------------------------------|
| %c                | Signed character                   |
|-------------------+------------------------------------|
| %f                | Signed float                       |
|-------------------+------------------------------------|
| %e                | A floating-point number            |
|-------------------+------------------------------------|
| %s                | A string or sequence of characters |
|-------------------+------------------------------------|
| %lf               | double                             |
|-------------------+------------------------------------|
| %Lf               | Long double                        |
|-------------------+------------------------------------|
| %o                | Octal integer                      |
|-------------------+------------------------------------|
| %u                | Short unsigned integer             |
|-------------------+------------------------------------|
| %ld               | Long decimal integer               |
|-------------------+------------------------------------|
| %x                | Hexadecimal integer                |
|-------------------+------------------------------------|
| %p                | Print memory address in the        |
|                   | hexadecimal form                   |
|-------------------+------------------------------------|

The below example uses the formula °C = (5/9)(°F - 32) to print a table of
Fahrenheit temperatures and their centigrade or Celsius equivalents:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int fahr, celsius;
    int lower, upper, step;

    lower = 0; //lower limit of temperature table
    upper = 300; //upper limit
    step = 20; //step size

    fahr = lower;
    while (fahr <= upper) {
    celsius = 5 * (fahr-32) /9;
    printf("%d\t%d\n", fahr, celsius);
    fahr = fahr + step;
    }
  }
  #+END_SRC
Output:
  #+RESULTS:
  #+begin_example
  0	-17
  20	-6
  40	4
  60	15
  80	26
  100	37
  120	48
  140	60
  160	71
  180	82
  200	93
  220	104
  240	115
  260	126
  280	137
  300	148
  #+end_example
-----
The program consists of the definition of a single function names main. The
program is longer than the one that printed "hello, world" but is no
complicated. It makes use of several core concepts:
- comments
- declarations
- variables
- arithmetic expressions
- loops
- formatted output

In C all variables must be declared before they are used, this is usually done
at the beginning of a function before any executable statements. A declaration
announces the properties of variables; it consists of a type name and a list of
variables such as:
-----
#+BEGIN_SRC C :results output
  int fahr, celsius;
  int lower, upper, step;
  #+END_SRC
-----
  
*** %d (Decimal Integer):

-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int a=50;
    printf("The integer value of a is %d \n",a);
    return 0;
  }
  #+END_SRC

  #+RESULTS:
  : The integer value of a is 50 
-----

*** %c (Character):

-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    char myChar = 'a';

    printf("The first letter of the alphabet is: %c", myChar);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The first letter of the alphabet is: a
-----

*** %f (Floating Point):

-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    float a = 3;
    printf("The floating point of a is %f \n", a);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The floating point of a is 3.000000 
-----

*** %e (Floating Pointer Number):

-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    float a = 12.5;
    printf("The floating-point of a is %e\n", a);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The floating-point of a is 1.250000e+01
-----

*** %s (String):

-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    char s[15] = "String";
    printf("The string value of s is %s\n", s);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The string value of s is String
-----

