temp/c-compendium.tex
\subsection{Void Types:}
\label{sec:org55efd68}
The void type specifies that no value is availabe. It is used in three
situtations:
\begin{center}
\begin{tabular}{l|l}
\hline
TYPE & DESCRIPTION / USE\\
\hline
Functions returns as void & There are various functions in C which do not return\\
 & any value or you can say they return void. A function\\
 & with no return value has the return type as void.\\
 & For example: \textbf{void exit(int status);}\\
\hline
Function arguments as void & There are various functions in C which do  not accept\\
 & any parameter. A function with no parameter can accept\\
 & a void.\\
 & For example: \textbf{int rand(void);}\\
\hline
Pointers to void & A pointer of type void * represents the address of an\\
 & object, but not it's type.\\
 & For example: a memory allocation function\\
 & void *malloc( size\textsubscript{t} size);\\
 & returns a pointer to void which can be casted to any\\
 & data type.\\
\hline
\end{tabular}
\end{center}

\subsection{Derived types:}
\label{sec:org66c6d8e}
The derived data types are basically derived out of the fundamental datatypes. A
derived data type won’t typically create a new data type – but would add various
new functionalities to the existing ones instead.

We can derive the derived data types out of the primitive data type by adding
some extra relationships to the elements that are available with the primitive
data types. We use the derived data types to represent multiple values as well
as single values in a program.

Below are the types of derived data types and their uses:
\begin{center}
\begin{tabular}{l|l}
\hline
TYPE & DECRIPTION / USE\\
\hline
arrays & refers to a sequence (ordered sequence) of a finite number of data items from\\
 & the same data type sharing one common name\\
\hline
function & refers to a self-contained block of single or multiple statements. It has it's\\
 & own specified name.\\
\hline
pointers & refers to a some special form of variables that one can use for holding\\
 & other variables' addresses.\\
\hline
structures & A collection of various different types of data type items that get stored in\\
 & a contagious type of memory allocation is known as structure in C.\\
\hline
\end{tabular}
\end{center}

\clearpage
\section{Variables:}
\label{sec:org3dbf7e5}
Variables are containers for storing data values, like numbers and
characters. Like mentioned previously there are different \textbf{data types} in
C. These data types are used to declare variable types.

\subsection{Syntax:}
\label{sec:org48f3612}
To create a variable specify the type and assign it a value.
\begin{center}
\begin{tabular}{llll}
\hline
type & variableName & = & value;\\
\hline
Example: &  &  & \\
int & myNum & = & 32;\\
\hline
\end{tabular}
\end{center}
The above example will create an integer variable called myNum with the value
of 15.

You can also declare a variable without assigning the value and assign it
later.

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNum; //declare the variable

  myNum = 32; //assign a value to it
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Output variables:}
\label{sec:org02a8fd0}
To output variables in C you must use "format specifiers":
These are used together with the \textbf{printf()} function to tell the compiler what
data type the variable is.
A format specifier starts with the \textbf{\%} sign followed by a character.
The most common format specifiers are listed below:
\begin{center}
\begin{tabular}{l|l}
\hline
Format specifiers & Type of output\\
\hline
\%d or \%i & A decimal inter or signed integer\\
\hline
\%c & Signed character\\
\hline
\%f & Signed float\\
\hline
\%e & A floating-point number\\
\hline
\%s & A string or sequence of characters\\
\hline
\%lf & double\\
\hline
\%Lf & Long double\\
\hline
\%o & Octal integer\\
\hline
\%u & Short unsigned integer\\
\hline
\%ld & Long decimal integer\\
\hline
\%x & Hexadecimal integer\\
\hline
\%p & Print memory address in the\\
 & hexadecimal form\\
\hline
\end{tabular}
\end{center}

See examples of the uses of each below:

\subsubsection{\%d (Decimal Integer):}
\label{sec:org955a7c5}

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int a=50;
  printf("The integer value of a is %d \n",a);
  return 0;
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsubsection{\%c (Character):}
\label{sec:org983b021}

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  char myChar = 'a';

  printf("The first letter of the alphabet is: %c", myChar);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
The first letter of the alphabet is: a
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsubsection{\%f (Floating Point):}
\label{sec:org2f20d1d}

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  float a = 3;
  printf("The floating point of a is %f \n", a);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
The floating point of a is 3.000000 
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsubsection{\%e (Floating Pointer Number):}
\label{sec:org09ec0a0}

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  float a = 12.5;
  printf("The floating-point of a is %e\n", a);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
The floating-point of a is 1.250000e+01
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsubsection{\%s (String):}
\label{sec:orge6f772f}

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  char s[15] = "String";
  printf("The string value of s is %s\n", s);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
The string value of s is String
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
