c-compendium/c-compendium.org
*** %lf (Double):

-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    double d = 12.5;
    printf("The double value of d is %lf\n", d);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The double value of d is 12.500000
-----

*** %o (octal integer):
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int oct = 11;
    printf("The octal integer value of oct is %o\n", oct);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The octal integer value of oct is 13
-----

*** %x (Hexadecimal Integer):

-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int h = 14;
    printf("The hexadecimal value of h is %x\n", h);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The hexadecimal value of h is e
-----

*** %p (Prints Memory Address):
To find the memory address that holds values of a variable, we use the %p format
specifier and it prints in hexadecimal form.
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int sum = 0;
    printf("The memory address of sum is %p\n", &sum);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The memory address of sum is 0x7ffdf9e40ce4
-----

** Changing variable values:
*Note:* if you assign values to an existing variable, it will overwrite the
 previous value.

 -----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myNum = 15; //myNum is 15
    myNum = 10;     //myNum is now 10

    printf("%d", myNum);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 10
-----

You can also assign the value of one variable to another:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myNum = 15;
    int myNumTwo = 23;

    //Assign the value of myNumTwo (23) to myNum
    myNum = myNumTwo;

    printf("myNum= %d\n", myNum);
    printf("myNumTwo= %d", myNumTwo);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : myNum= 23
  : myNumTwo= 23
-----

** Add variables together:
To add variables together use the *+* operator:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int x = 5;
    int y = 6;
    int sum = x + y;
    printf("%d", sum);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 11
-----

** Declare multiple variables:
To declare more than one variable of the same type use a comma-seperated list:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int x = 5, y = 6, z = 50;
    printf("%d", x + y + z);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 61
-----
You can also assign the same value to multiple variables of the same type:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int x, y, z;
    x = y = z = 50;
    printf("%d", x + y + z);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 150
-----

** Variable names:
All C variables must be identified with unique names.
These unique names are called *identifiers*.
Identifiers can be short names (like x and y) or more descriptive names (ages,
sum, totalVolume).
*Note:* It is recommended to use descriptive names in order to create
understandable and maintainable code:

The general rules for naming variables are:
- Names can contain letters, digits and underscores.
- Names must begin with a letter or an underscore(_).
- Names are case sensitive.
- Names cannot contain whitespaces or special characters like !, #, %, etc.
- Reserved words (such as int) cannot be used as names.

** Real life example:
-----
#+BEGIN_SRC C :results output
    #include <stdio.h>

  int main(){
  // Student data
  int studentID = 15;
  int studentAge = 23;
  float studentFee = 75.25;
  char studentGrade = 'B';

  // Print variables
  printf("Student id: %d\n", studentID);
  printf("Student age: %d\n", studentAge);
  printf("Student fee: %f\n", studentFee);
  printf("Student grade: %c", studentGrade);
    }
  #+END_SRC

  #+RESULTS:
  : Student id: 15
  : Student age: 23
  : Student fee: 75.250000
  : Student grade: B

-----
\clearpage
* Constants:
To prevent a variable from being changed you can use the *const* keyword.
This will declare the variable as "constant", which means unchangeable and
read-only:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    const int myNum = 15; //myNum will always be 15
    myNum = 10; //Attempting to change the variable will output an error.
  }
  #+END_SRC
-----

You should always declare the variable as constant when you have values that are
unlikely to change:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    const int minutesPerHour = 60;
    const float PI = 3.14;

    printf("Minutes per hour: %i\n", minutesPerHour);
    printf("PI: %f", PI);
  }
  #+END_SRC
Output:
  #+RESULTS:
  : Minutes per hour: 60
  : PI: 3.140000
-----

** Things to note:
When you declare a constant variable, it must be assigned with a value:
*Like this:*
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    const int minutesPerHour = 60
  }
  #+END_SRC
-----
*This will not work:*
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    const int minutesPerHour;
    minutesPerHour = 60; //error
  }
  #+END_SRC
-----
Another thing to note about constants is that it is considered good practice to
declare them in CAPS. It isn't required but makes your code more readable and
ensures that constant variables are easily distinguishable.
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    const int BIRTHYEAR = 2023;
  }
  #+END_SRC
-----
\clearpage
* Operators:
Operators are used to perform operations on variables and values.
In the example below, the *+* operator is used to add two values together.
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myNum = 1+2;
    printf("%i", myNum);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 3
-----
Although the *+* operator is often used to add together two values like in the
example above it can also be used to add together a variable and a value or a
variable and another variable:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int sum1 = 100 + 50; //150 
    int sum2 = sum1 + 250; //400
    int sum3 = sum2 + sum2; //800?

    printf("%i", sum3);
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 800
-----
** Operator groups:
C divides operators into the following groups:
- Arithmetic operators
- Assignment operators
- Comparison operators
- Logical operators
- Bitwise operators

