temp/c-compendium.tex

\subsubsection{\%lf (Double):}
\label{sec:org61f79cb}

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  double d = 12.5;
  printf("The double value of d is %lf\n", d);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
The double value of d is 12.500000
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsubsection{\%o (octal integer):}
\label{sec:org2dd8196}
\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int oct = 11;
  printf("The octal integer value of oct is %o\n", oct);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
The octal integer value of oct is 13
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsubsection{\%x (Hexadecimal Integer):}
\label{sec:orgb5dbe00}

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int h = 14;
  printf("The hexadecimal value of h is %x\n", h);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
The hexadecimal value of h is e
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsubsection{\%p (Prints Memory Address):}
\label{sec:org76d46d1}
To find the memory address that holds values of a variable, we use the \%p format
specifier and it prints in hexadecimal form.

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int sum = 0;
  printf("The memory address of sum is %p\n", &sum);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
The memory address of sum is 0x7ffdf9e40ce4
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Changing variable values:}
\label{sec:org9b327b2}
\textbf{Note:} if you assign values to an existing variable, it will overwrite the
 previous value.

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNum = 15; //myNum is 15
  myNum = 10;     //myNum is now 10

  printf("%d", myNum);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
10
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

You can also assign the value of one variable to another:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNum = 15;
  int myNumTwo = 23;

  //Assign the value of myNumTwo (23) to myNum
  myNum = myNumTwo;

  printf("myNum= %d\n", myNum);
  printf("myNumTwo= %d", myNumTwo);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
myNum= 23
myNumTwo= 23
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Add variables together:}
\label{sec:orgcb162a9}
To add variables together use the \textbf{+} operator:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int x = 5;
  int y = 6;
  int sum = x + y;
  printf("%d", sum);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
11
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Declare multiple variables:}
\label{sec:org5282a61}
To declare more than one variable of the same type use a comma-seperated list:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int x = 5, y = 6, z = 50;
  printf("%d", x + y + z);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
61
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
You can also assign the same value to multiple variables of the same type:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int x, y, z;
  x = y = z = 50;
  printf("%d", x + y + z);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
150
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Variable names:}
\label{sec:org64e4db9}
All C variables must be identified with unique names.
These unique names are called \textbf{identifiers}.
Identifiers can be short names (like x and y) or more descriptive names (ages,
sum, totalVolume).
\textbf{Note:} It is recommended to use descriptive names in order to create
understandable and maintainable code:

The general rules for naming variables are:
\begin{itemize}
\item Names can contain letters, digits and underscores.
\item Names must begin with a letter or an underscore(\_).
\item Names are case sensitive.
\item Names cannot contain whitespaces or special characters like !, \#, \%, etc.
\item Reserved words (such as int) cannot be used as names.
\end{itemize}

\subsection{Real life example:}
\label{sec:orgdeb1626}
\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
  #include <stdio.h>

int main(){
// Student data
int studentID = 15;
int studentAge = 23;
float studentFee = 75.25;
char studentGrade = 'B';

// Print variables
printf("Student id: %d\n", studentID);
printf("Student age: %d\n", studentAge);
printf("Student fee: %f\n", studentFee);
printf("Student grade: %c", studentGrade);
  }
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\clearpage
\section{Constants:}
\label{sec:org8e41afb}
To prevent a variable from being changed you can use the \textbf{const} keyword.
This will declare the variable as "constant", which means unchangeable and
read-only:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  const int myNum = 15; //myNum will always be 15
  myNum = 10; //Attempting to change the variable will output an error.
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

You should always declare the variable as constant when you have values that are
unlikely to change:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  const int minutesPerHour = 60;
  const float PI = 3.14;

  printf("Minutes per hour: %i\n", minutesPerHour);
  printf("PI: %f", PI);
}
\end{verbatim}
Output:
\begin{verbatim}
Minutes per hour: 60
PI: 3.140000
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Things to note:}
\label{sec:orge00c8d9}
When you declare a constant variable, it must be assigned with a value:
\textbf{Like this:}

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  const int minutesPerHour = 60
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\textbf{This will not work:}

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  const int minutesPerHour;
  minutesPerHour = 60; //error
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
Another thing to note about constants is that it is considered good practice to
declare them in CAPS. It isn't required but makes your code more readable and
ensures that constant variables are easily distinguishable.

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  const int BIRTHYEAR = 2023;
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\clearpage
\section{Operators:}
\label{sec:orgf50664a}
Operators are used to perform operations on variables and values.
In the example below, the \textbf{+} operator is used to add two values together.

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNum = 1+2;
  printf("%i", myNum);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
3
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
Although the \textbf{+} operator is often used to add together two values like in the
example above it can also be used to add together a variable and a value or a
variable and another variable:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int sum1 = 100 + 50; //150 
  int sum2 = sum1 + 250; //400
  int sum3 = sum2 + sum2; //800?

  printf("%i", sum3);
}
\end{verbatim}
Output:
\begin{verbatim}
800
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\subsection{Operator groups:}
\label{sec:org26ae17b}
C divides operators into the following groups:
\begin{itemize}
\item Arithmetic operators
\item Assignment operators
\item Comparison operators
\item Logical operators
\item Bitwise operators
\end{itemize}
