c-compendium/c-compendium.org
*** Arithmetic operators:
Arithmetic operators are used to  perfrom common mathematical operations.
| /        | <              | <                                      | <       |
|----------+----------------+----------------------------------------+---------|
| OPERATOR | NAME           | DESCRIPTION                            | EXAMPLE |
|----------+----------------+----------------------------------------+---------|
| "+"      | addition       | Adds two values                        | x + y   |
|----------+----------------+----------------------------------------+---------|
| "-"      | subtraction    | Subtracts one value from another       | x - y   |
|----------+----------------+----------------------------------------+---------|
| "*"      | multiplication | Multiplies two values                  | x * y   |
|----------+----------------+----------------------------------------+---------|
| "/"      | division       | Divides one value by another           | x / y   |
|----------+----------------+----------------------------------------+---------|
| %        | modulus        | Returns the division remained          | x % y   |
|----------+----------------+----------------------------------------+---------|
| ++       | increment      | Increases the value of a variable by 1 | ++x     |
|----------+----------------+----------------------------------------+---------|
| --       | decrement      | Decreases the value of a variable by 1 | --x     |
|----------+----------------+----------------------------------------+---------|

*** Assignment operators:
Assignment operators are used to assign values to variables.

| /        | <       | <          |
|----------+---------+------------|
| OPERATOR | EXAMPLE | SAME AS    |
|----------+---------+------------|
| "="      | x = 5   | x =5       |
|----------+---------+------------|
| "+="     | x += 3  | x = x + 3  |
|----------+---------+------------|
| "-="     | x -= 3  | x = x - 3  |
|----------+---------+------------|
| "*="     | x *= 3  | x = x * 3  |
|----------+---------+------------|
| "/="     | x /= 3  | x = x / 3  |
|----------+---------+------------|
| "%="     | x %= 3  | x = x % 3  |
|----------+---------+------------|
| "&="     | x &= 3  | x = x & 3  |
|----------+---------+------------|
| "^="     | x ^=3   | x = x ^ 3  |
|----------+---------+------------|
| ">>="    | x >>= 3 | x = x >> 3 |
|----------+---------+------------|
| "<<="    | x <<= 3 | x = x << 3 |
|----------+---------+------------|

*** Comparison operators:
Comparison operators are used to compare two values (or variables). This is
important in programming, because it helps us to find answers and make
decisions.
| /        | <                        | <       |
|----------+--------------------------+---------|
| OPERATOR | NAME                     | EXAMPLE |
|----------+--------------------------+---------|
| "=="     | Equal to                 | x == y  |
|----------+--------------------------+---------|
| "!="     | Not equal                | x != y  |
|----------+--------------------------+---------|
| ">"      | Greater than             | x > y   |
|----------+--------------------------+---------|
| "<"      | Less than                | x < y   |
|----------+--------------------------+---------|
| ">="     | Greater than or equal to | x >= y  |
|----------+--------------------------+---------|
| "<="     | Less than or equal to    | x <= y  |
|----------+--------------------------+---------|

The return value of a comparison is either 1 or 0, which means true(1) or
false(0). These values are known as *Boolean values*. The boolean concept is
better explained in the *booleans and if...else* sections.

*** Logical operators:
You can also test for true or false with logical operators.
Logical operators are used to determine the logic between variables or values:
| /        | <           | <                    | <                   |
|----------+-------------+----------------------+---------------------|
| OPERATOR | NAME        | DESCRIPTION          | EXAMPLE             |
|----------+-------------+----------------------+---------------------|
| "&&"     | Logical and | Returns true if both | x < 5 && x < 10     |
|          |             | statements are true  |                     |
|----------+-------------+----------------------+---------------------|
| "!"      | Logical not | Reverse the result,  | !(x < 5 && x < (10) |
|          |             | returns false if the |                     |
|          |             | result is true       |                     |
|----------+-------------+----------------------+---------------------|

*** Sizeof operator:
The memory size (in bytes) of a data type or a variable can be found with the
*sizeof* operator:

-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myInt;
    float myFloat;
    double myDouble;
    char myChar;

    printf("%lu\n", sizeof(myInt));
    printf("%lu\n", sizeof(myFloat));
    printf("%lu\n", sizeof(myDouble));
    printf("%lu\n", sizeof(myChar));

  }
  #+END_SRC
Output:
  #+RESULTS:
  : 4
  : 4
  : 8
  : 1
-----
*Note:* the *%lu* format specifier is used to print the result, instead of
 &d. This is because the compiler expects the sizeof operator to return a *long
 unsigned int* (%lu) instead of int (%d).

\clearpage
\clearpage
* Booleans:
Very often in  programming you will need a data type that can only have one of
two values, like:
- YES / NO
- ON / OFF
- True / FALSE
For this, C has a bool data type, which is known as booleans.
Booleans represent data values that are either true or false.

** Boolean variables:
In C, the bool type is not a built-in data type, like int or char.
It was introduced in C99 and must be imported with the following header file to
be used:
-----
#+BEGIN_SRC C :results output
  #include <stdbool.h>
  #+END_SRC
-----

A boolean variable is declared with the *bool* keyword and can only take the
values true or false:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>
  #include <stdbool.h>

  int main(){
    bool isProgrammingFun = true;
    bool isFishTasty = false;

    printf("%d\n", isProgrammingFun); //Returns 1 (true)
    printf("%d", isFishTasty);      //Returns 0 (false)
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 1
  : 0
-----
*Note:* boolean values are returned as integers:
- 1 (or any number that isn't 0) represents true
- 0 represents false
Therefore, you must use the %d format specifier to print a boolean variable.

** Comparing Values and Variables:
Comparing values can be very  useful in programming, because it helps us find
answers and make decisions.
For example, you can use a comparison operator, such as greater than (>) to
compare two values:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>
  #include <stdbool.h>

  int main(){
    printf("%d", 10 > 9); //Returns 1 (true) because 10 is greater than 9
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 1
-----
In the same way you can compare two variables:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>
  #include <stdbool.h>

  int main(){
    int x = 10;
    int y = 9;
    printf("%d", x > y);
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 1
-----
In the example below, the equal to (==) operator is used to compare different
values:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>
  #include <stdbool.h>

  int main(){
    printf("%d", 10 == 10); //Returns 1 because 10 is equal to  10
    printf("%d", 10 == 15); //Returns 0 because 10 is not equal to 15
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 10
-----
You are not limited to only compare numbers, You can compare variables or even
special structures like arrays:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>
  #include <stdbool.h>

  int main(){
    bool isProgrammingFun = true;
    bool isProgrammingTasty = false;

    //find out if both statements are true:
    printf("%d", isProgrammingFun == isProgrammingTasty);
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 0
-----

** Real life example:
This example checks if a person is old enough to vote.
-----
#+BEGIN_SRC C :results output
	  #include <stdio.h>
	  #include <stdbool.h>

	  int main(){
	    int myAge = 22;
	    int votingAge = 18;

	    if (myAge >= votingAge) {
	    printf("Old enough to vote!");
	    } else {
	    printf("Not old enough to vote.");
	      }
	  }
  #+END_SRC
Output:
  #+RESULTS:
  : Old enough to vote!
-----

\clearpage
\clearpage
