temp/c-compendium.tex

\subsubsection{Arithmetic operators:}
\label{sec:org58d2e8e}
Arithmetic operators are used to  perfrom common mathematical operations.
\begin{center}
\begin{tabular}{l|l|l|l}
\hline
OPERATOR & NAME & DESCRIPTION & EXAMPLE\\
\hline
"+" & addition & Adds two values & x + y\\
\hline
"-" & subtraction & Subtracts one value from another & x - y\\
\hline
"*" & multiplication & Multiplies two values & x * y\\
\hline
"/" & division & Divides one value by another & x / y\\
\hline
\% & modulus & Returns the division remained & x \% y\\
\hline
++ & increment & Increases the value of a variable by 1 & ++x\\
\hline
-- & decrement & Decreases the value of a variable by 1 & --x\\
\hline
\end{tabular}
\end{center}

\subsubsection{Assignment operators:}
\label{sec:org686d866}
Assignment operators are used to assign values to variables.

\begin{center}
\begin{tabular}{l|l|l}
\hline
OPERATOR & EXAMPLE & SAME AS\\
\hline
"=" & x = 5 & x =5\\
\hline
"+=" & x += 3 & x = x + 3\\
\hline
"-=" & x -= 3 & x = x - 3\\
\hline
"*=" & x *= 3 & x = x * 3\\
\hline
"/=" & x /= 3 & x = x / 3\\
\hline
"\%=" & x \%= 3 & x = x \% 3\\
\hline
"\&=" & x \&= 3 & x = x \& 3\\
\hline
"\^{}=" & x \^{}=3 & x = x \^{} 3\\
\hline
">>=" & x >>= 3 & x = x >> 3\\
\hline
"<<=" & x <<= 3 & x = x << 3\\
\hline
\end{tabular}
\end{center}

\subsubsection{Comparison operators:}
\label{sec:org2430962}
Comparison operators are used to compare two values (or variables). This is
important in programming, because it helps us to find answers and make
decisions.
\begin{center}
\begin{tabular}{l|l|l}
\hline
OPERATOR & NAME & EXAMPLE\\
\hline
"==" & Equal to & x == y\\
\hline
"!=" & Not equal & x != y\\
\hline
">" & Greater than & x > y\\
\hline
"<" & Less than & x < y\\
\hline
">=" & Greater than or equal to & x >= y\\
\hline
"<=" & Less than or equal to & x <= y\\
\hline
\end{tabular}
\end{center}

The return value of a comparison is either 1 or 0, which means true(1) or
false(0). These values are known as \textbf{Boolean values}. The boolean concept is
better explained in the \textbf{booleans and if\ldots{}else} sections.

\subsubsection{Logical operators:}
\label{sec:org2f6a640}
You can also test for true or false with logical operators.
Logical operators are used to determine the logic between variables or values:
\begin{center}
\begin{tabular}{l|l|l|l}
\hline
OPERATOR & NAME & DESCRIPTION & EXAMPLE\\
\hline
"\&\&" & Logical and & Returns true if both & x < 5 \&\& x < 10\\
 &  & statements are true & \\
\hline
"!" & Logical not & Reverse the result, & !(x < 5 \&\& x < (10)\\
 &  & returns false if the & \\
 &  & result is true & \\
\hline
\end{tabular}
\end{center}

\subsubsection{Sizeof operator:}
\label{sec:org7f78631}
The memory size (in bytes) of a data type or a variable can be found with the
\textbf{sizeof} operator:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myInt;
  float myFloat;
  double myDouble;
  char myChar;

  printf("%lu\n", sizeof(myInt));
  printf("%lu\n", sizeof(myFloat));
  printf("%lu\n", sizeof(myDouble));
  printf("%lu\n", sizeof(myChar));

}
\end{verbatim}
Output:
\begin{verbatim}
4
4
8
1
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\textbf{Note:} the \textbf{\%lu} format specifier is used to print the result, instead of
 \&d. This is because the compiler expects the sizeof operator to return a \textbf{long
 unsigned int} (\%lu) instead of int (\%d).

\clearpage
\clearpage
\section{Booleans:}
\label{sec:org8f69de6}
Very often in  programming you will need a data type that can only have one of
two values, like:
\begin{itemize}
\item YES / NO
\item ON / OFF
\item True / FALSE
\end{itemize}
For this, C has a bool data type, which is known as booleans.
Booleans represent data values that are either true or false.

\subsection{Boolean variables:}
\label{sec:org6e76591}
In C, the bool type is not a built-in data type, like int or char.
It was introduced in C99 and must be imported with the following header file to
be used:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdbool.h>
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

A boolean variable is declared with the \textbf{bool} keyword and can only take the
values true or false:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>
#include <stdbool.h>

int main(){
  bool isProgrammingFun = true;
  bool isFishTasty = false;

  printf("%d\n", isProgrammingFun); //Returns 1 (true)
  printf("%d", isFishTasty);      //Returns 0 (false)
}
\end{verbatim}
Output:
\begin{verbatim}
1
0
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\textbf{Note:} boolean values are returned as integers:
\begin{itemize}
\item 1 (or any number that isn't 0) represents true
\item 0 represents false
\end{itemize}
Therefore, you must use the \%d format specifier to print a boolean variable.

\subsection{Comparing Values and Variables:}
\label{sec:orgaff9972}
Comparing values can be very  useful in programming, because it helps us find
answers and make decisions.
For example, you can use a comparison operator, such as greater than (>) to
compare two values:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>
#include <stdbool.h>

int main(){
  printf("%d", 10 > 9); //Returns 1 (true) because 10 is greater than 9
}
\end{verbatim}
Output:
\begin{verbatim}
1
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In the same way you can compare two variables:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>
#include <stdbool.h>

int main(){
  int x = 10;
  int y = 9;
  printf("%d", x > y);
}
\end{verbatim}
Output:
\begin{verbatim}
1
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In the example below, the equal to (==) operator is used to compare different
values:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>
#include <stdbool.h>

int main(){
  printf("%d", 10 == 10); //Returns 1 because 10 is equal to  10
  printf("%d", 10 == 15); //Returns 0 because 10 is not equal to 15
}
\end{verbatim}
Output:
\begin{verbatim}
10
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
You are not limited to only compare numbers, You can compare variables or even
special structures like arrays:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>
#include <stdbool.h>

int main(){
  bool isProgrammingFun = true;
  bool isProgrammingTasty = false;

  //find out if both statements are true:
  printf("%d", isProgrammingFun == isProgrammingTasty);
}
\end{verbatim}
Output:
\begin{verbatim}
0
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Real life example:}
\label{sec:org96505c4}
This example checks if a person is old enough to vote.

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>
#include <stdbool.h>

int main(){
  int myAge = 22;
  int votingAge = 18;

  if (myAge >= votingAge) {
  printf("Old enough to vote!");
  } else {
  printf("Not old enough to vote.");
    }
}
\end{verbatim}
Output:
\begin{verbatim}
Old enough to vote!
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\clearpage
\clearpage
