c-compendium/c-compendium.org
* if Statements:
In C there are several types of *'if'* statements that are used to control the
flow of execution in a program. The main difference between the different types
of 'if' statements is in their syntax and how they are used in different
situations.
Here are the different types of 'if' statements and their syntax:
** Conditions and if statements:
In previous sections the use of logical conditions were mentioned:
- Less than: a < b
- Less than or equal to: a  <= b
- Greater than: a > b
- Greater than or equal to: a >= b
- Equal to: a == b
- Not equal to: a != b

In C programming, conditional statements are used to perfrom different actions
based on different conditions.
C has the following conditional statements:
- Use *if* to specify a block of code to be executed if a specified condition is
  *true*
- Use *else* to specify a block of code to be executed, if the same condition is
  *false*
- Use *else if* to specify a new condition to test, if the first condition is
  *false*
- Use *switch* to specify many alternative blocks of code to be executed

** if Statement:
The "*if*" statement is used for making decisions based on certain
conditions. It allows a program to execute different statements based on whether
a specified condition is true or false.

*** Syntax and examples:
-----
#+BEGIN_SRC C :results output
  if (condition) {
    //code to be executed if the condition is true
  }
  #+END_SRC
-----

The *"condition"* is an expression that is evaluated to either true or false. If
the "*condition"* is true then the code inside the curly braces is executed,
otherwise the code is skipped.
For example:

-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int x = 5;
    if (x > 3) {
      printf("x is greater than 3");
    }
  }
  #+END_SRC
Output:
  #+RESULTS:
  : x is greater than 3
-----
In this example, the *"if"* statement check if "*x*" is greater than 3. Since
*x* is indeed greater than 3, the message "x is greater than 3" is printed in
the output.

** if ... else Statement:
The *'if else'* statement is used for making decisions based on certain
conditions. It allows a program to execute different statements based on whether
a specified condition is true or false. The '*if else*' statement provides an
alternative execution path if the condition is false.

*** Syntax and examples:
-----
#+BEGIN_SRC C :results output
  if (condition) {
    //condition to be if the condition is true
  } else {
    //code to be executed if the condition is false
  }
  #+END_SRC
-----
The '*condition*' is an expression that is evaluated to either true or false. If
the '*condition*' is true, then the code inside the first block of curly
braces is executed, otherwise the code inside the inside the second block of
curly braces is executed.
For example:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int x = 5;
    if (x > 3 ) {
      printf("x is greater than 3");
    } else {
      printf("x is less than or equal to 3");
    }
  }
  #+END_SRC
Output:
  #+RESULTS:
  : x is greater than 3
-----
In this example the '*if*' statements checks if '*x*' is greater than 3. Since
'*x*' is indeed greater than 3, the message "x is greater than 3" is printed in
the output. If '*x*' were less than or equal to 3, the message "x is less than
or equal to 3" would be outputted instead.

The '*if else*' statement can also be nested, which means that an '*if else*'
statement can be placed inside another '*if else*' statement. This is useful for
testinng multiple conditions. The syntax for a nested '*if else*' statement is
as follows:
-----
#+BEGIN_SRC C :results output
	      if (condition) {
	      //code to be executed if condition is true
	      } else if (condition2) {
	      //code to be executed if condition1 is false and condition2 is true
	      } else {
	      //code to be executed if both condition1 and condition2 are false
	      }
  #+END_SRC
-----
For example:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>
  #include <stdbool.h>
    int main() {
      int x = 5;
      int y = 2;
      if (x > 3) {
	if (y > 1) {
	printf("x is greater than 3 and y is greater than 1");
	} else {
	printf("x is greater than 3 but y is less than or equal to 1");
	}
      } else {
	printf("x is less than or equal to 3");
      }
    }
  #+END_SRC
Output:
  #+RESULTS:
  : x is greater than 3 and y is greater than 1
-----
In this example the out '*if*' statement checks if '*x*' is greater
than 3. Since '*x*' is greater than 3, the inner '*if else*' statement is
executed, which checks if '*y*' is greater than 1. Since '*y*' is greater than
1, the message "x is greater than 3 and y is greater than 1" is printed in the
console. If "*y*' were less than or equal to 1, the message "x is greater than 3
but y is less than or equal to 1" would be printed instead. If '*x*' were less
than or equal to 3, the message "x is less than or equal to 3" would be printed
instead.

** else ... if Statement:
In C the '*else if*' statement is used to test multiple conditions in
sequence. It allows a program to executre different statments based on different
conditions in a hierarchical manner. The '*else if*' statement is placed after
an initial '*if*' statement and before the '*else*' statement.

*** Syntax and examples:

-----
#+BEGIN_SRC C :results output
	      if (condition1) {
	      //code to be executed if condition1 is true
	      } else if (condition2) {
	      //code to be executed if condition1 is false and condition2 is true
	      } else {
	      //code to be executed if both condition1 and condition2 are false
	      }
  #+END_SRC
-----

In this syntax, '*condition1*' is the initial condition that is tested in the
'*if*' statement. If '*condition1*' is false, the '*else if*' statement is
executed and the program tests the second condition '*condition2*'. If
'*condition2*' is true, then the code inside the second block of curly braces is
executed, otherwise, the code inside the third block of curly braces is
executed.

Here is an example of the '*else if*' statement:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int score = 85;

    if (score >= 90) {
	    printf("You got an A");
    } else if (score >= 80) {
      printf("You got a B");
    } else if (score >= 70) {
      printf("You got a C");
    } else if (score >= 60) {
      printf("You got a D");
    } else {
      printf("You failed");
    } 			      }
  #+END_SRC
Output:
  #+RESULTS:
  : You got a B
-----
In this example, the program checks the value of the 'score' variable and prints
a message depending on the score. The 'if' statements test if the score is
greater than or equal to 90. If it is, the message "You got an A" is printed. If
not, the next 'else if' statement is executed, which tests if the score is
greater than or equal to 80. If it is, the message "You got a B" is
printed. This process repeats for each 'else if' statement until a condition is
met. If none of the conditions are met, the message "you failed" is printed.

Note that in the example aboce each 'else if' statement is nested inside the
previous one. This creates a sequence of conditions that are tested one after
the other, allowing the program to choose the apporopriate message to print
based on the value of the 'score' variable.

