temp/c-compendium.tex
\section{if Statements:}
\label{sec:org801cdc8}
In C there are several types of \textbf{'if'} statements that are used to control the
flow of execution in a program. The main difference between the different types
of 'if' statements is in their syntax and how they are used in different
situations.
Here are the different types of 'if' statements and their syntax:
\subsection{Conditions and if statements:}
\label{sec:orgb727165}
In previous sections the use of logical conditions were mentioned:
\begin{itemize}
\item Less than: a < b
\item Less than or equal to: a  <= b
\item Greater than: a > b
\item Greater than or equal to: a >= b
\item Equal to: a == b
\item Not equal to: a != b
\end{itemize}

In C programming, conditional statements are used to perfrom different actions
based on different conditions.
C has the following conditional statements:
\begin{itemize}
\item Use \textbf{if} to specify a block of code to be executed if a specified condition is
\textbf{true}
\item Use \textbf{else} to specify a block of code to be executed, if the same condition is
\textbf{false}
\item Use \textbf{else if} to specify a new condition to test, if the first condition is
\textbf{false}
\item Use \textbf{switch} to specify many alternative blocks of code to be executed
\end{itemize}

\subsection{if Statement:}
\label{sec:org88203ff}
The "\textbf{if}" statement is used for making decisions based on certain
conditions. It allows a program to execute different statements based on whether
a specified condition is true or false.

\subsubsection{Syntax and examples:}
\label{sec:org8a795a4}
\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
if (condition) {
  //code to be executed if the condition is true
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

The \textbf{"condition"} is an expression that is evaluated to either true or false. If
the "\textbf{condition"} is true then the code inside the curly braces is executed,
otherwise the code is skipped.
For example:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int x = 5;
  if (x > 3) {
    printf("x is greater than 3");
  }
}
\end{verbatim}
Output:
\begin{verbatim}
x is greater than 3
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, the \textbf{"if"} statement check if "\textbf{x}" is greater than 3. Since
\textbf{x} is indeed greater than 3, the message "x is greater than 3" is printed in
the output.

\subsection{if \ldots{} else Statement:}
\label{sec:org3b318f0}
The \textbf{'if else'} statement is used for making decisions based on certain
conditions. It allows a program to execute different statements based on whether
a specified condition is true or false. The '\textbf{if else}' statement provides an
alternative execution path if the condition is false.

\subsubsection{Syntax and examples:}
\label{sec:org145a5d8}
\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
if (condition) {
  //condition to be if the condition is true
} else {
  //code to be executed if the condition is false
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
The '\textbf{condition}' is an expression that is evaluated to either true or false. If
the '\textbf{condition}' is true, then the code inside the first block of curly
braces is executed, otherwise the code inside the inside the second block of
curly braces is executed.
For example:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int x = 5;
  if (x > 3 ) {
    printf("x is greater than 3");
  } else {
    printf("x is less than or equal to 3");
  }
}
\end{verbatim}
Output:
\begin{verbatim}
x is greater than 3
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example the '\textbf{if}' statements checks if '\textbf{x}' is greater than 3. Since
'\textbf{x}' is indeed greater than 3, the message "x is greater than 3" is printed in
the output. If '\textbf{x}' were less than or equal to 3, the message "x is less than
or equal to 3" would be outputted instead.

The '\textbf{if else}' statement can also be nested, which means that an '\textbf{if else}'
statement can be placed inside another '\textbf{if else}' statement. This is useful for
testinng multiple conditions. The syntax for a nested '\textbf{if else}' statement is
as follows:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
if (condition) {
//code to be executed if condition is true
} else if (condition2) {
//code to be executed if condition1 is false and condition2 is true
} else {
//code to be executed if both condition1 and condition2 are false
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
For example:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>
#include <stdbool.h>
  int main() {
    int x = 5;
    int y = 2;
    if (x > 3) {
      if (y > 1) {
      printf("x is greater than 3 and y is greater than 1");
      } else {
      printf("x is greater than 3 but y is less than or equal to 1");
      }
    } else {
      printf("x is less than or equal to 3");
    }
  }
\end{verbatim}
Output:
\begin{verbatim}
x is greater than 3 and y is greater than 1
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example the out '\textbf{if}' statement checks if '\textbf{x}' is greater
than 3. Since '\textbf{x}' is greater than 3, the inner '\textbf{if else}' statement is
executed, which checks if '\textbf{y}' is greater than 1. Since '\textbf{y}' is greater than
1, the message "x is greater than 3 and y is greater than 1" is printed in the
console. If "\textbf{y}' were less than or equal to 1, the message "x is greater than 3
but y is less than or equal to 1" would be printed instead. If '\textbf{x}' were less
than or equal to 3, the message "x is less than or equal to 3" would be printed
instead.

\subsection{else \ldots{} if Statement:}
\label{sec:org070df4f}
In C the '\textbf{else if}' statement is used to test multiple conditions in
sequence. It allows a program to executre different statments based on different
conditions in a hierarchical manner. The '\textbf{else if}' statement is placed after
an initial '\textbf{if}' statement and before the '\textbf{else}' statement.

\subsubsection{Syntax and examples:}
\label{sec:org8493541}

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
if (condition1) {
//code to be executed if condition1 is true
} else if (condition2) {
//code to be executed if condition1 is false and condition2 is true
} else {
//code to be executed if both condition1 and condition2 are false
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

In this syntax, '\textbf{condition1}' is the initial condition that is tested in the
'\textbf{if}' statement. If '\textbf{condition1}' is false, the '\textbf{else if}' statement is
executed and the program tests the second condition '\textbf{condition2}'. If
'\textbf{condition2}' is true, then the code inside the second block of curly braces is
executed, otherwise, the code inside the third block of curly braces is
executed.

Here is an example of the '\textbf{else if}' statement:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int score = 85;

  if (score >= 90) {
	  printf("You got an A");
  } else if (score >= 80) {
    printf("You got a B");
  } else if (score >= 70) {
    printf("You got a C");
  } else if (score >= 60) {
    printf("You got a D");
  } else {
    printf("You failed");
  } 			      }
\end{verbatim}
Output:
\begin{verbatim}
You got a B
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, the program checks the value of the 'score' variable and prints
a message depending on the score. The 'if' statements test if the score is
greater than or equal to 90. If it is, the message "You got an A" is printed. If
not, the next 'else if' statement is executed, which tests if the score is
greater than or equal to 80. If it is, the message "You got a B" is
printed. This process repeats for each 'else if' statement until a condition is
met. If none of the conditions are met, the message "you failed" is printed.

Note that in the example aboce each 'else if' statement is nested inside the
previous one. This creates a sequence of conditions that are tested one after
the other, allowing the program to choose the apporopriate message to print
based on the value of the 'score' variable.
