temp/c-compendium.tex

\subsection{Short hand if \ldots{} else:}
\label{sec:orgb12a709}
There is also a shorthand if else, which is known as the ternary operator\footnote{Operand: a term used to refer to a value or a variable that is operated
on by an operator.}
because it consists of three operands\footnote{Operator is a symbol that performs some operation on one
or more operands to produce a result.}. The shorthand 'if-else' statement
is a compact way of writing an 'if-else' statement that consists of a single
line of code for each condition. It is also known as a conditional operator.

\subsubsection{Syntax:}
\label{sec:org7ea93d4}
\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
(condition) ? expression1 : expression2;
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this syntax 'condition' is the condtition that is tested, 'expression' is the
expression that is evaluated if this condition is true, and 'expression2' is the
expression that is evaluated if the condition is false.

Here's an example:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int score = 85;
  char grade = (score >= 60) ? 'P' : 'F';
  printf("Your grade is %c", grade);
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
Your grade is P
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, the program checks the value of the 'score' variable and
assigns the grade 'P' if the score is greater than or equal to 60, and 'F'
otherwise. The shorthand 'if-else' statement is used to evaluate the condition
and assign the apporopriate grade to the 'grade' variable.

Note that the shorthand 'if-else' statement is often used in situations where a
simple condition needs to be tested and the result of the condition needs to be
assigned to a variable. However, it can also be used in more complex
expressions, such as nested expressions or expressions involving multiple
operators.

It's important to note that the shorthand 'if-else' statement should be used
judiciously, as it can make code more difficult to read and understand if used
excessively. It's generally best to use the full 'if-else' statement for more
complex conditions and the shorthand 'if-else' statement for simpler conditions.














\section{Switch statement:}
\label{sec:org3b571dc}
Instead of writing many 'if \ldots{} else' statements, you can use the switch
statement.

The 'switch' statement is a control statement that allows the execution of
different sections of code depending on the value of a variable or an
expression. The 'switch' statement is commonly used when there are many possible
cases to consider, and it provides a more concise and readable way to express
complex conditional logic than a series of nested 'if' statements.

\subsection{Syntax:}
\label{sec:org0325919}
\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
  switch (expression) {
   case constant1:
     //statements to be executed if expression == constant1
     break;
   case constant2:
    //statements to be executed if expression == constant2
     break;


   case constantN:
     //statements to be executed if expression == constantN
     break;
   default:
     //statements to be executed if none of the above cases are ture
     break;
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this syntax, 'expression' is the variable or expression that is being tested,
and 'constant1' to 'constantN' are the values or expressions that are being
compared to the value of 'expression'. If the value of 'expression' matches one
of the constants, the statements inside that case block are executed. If none of
the cases match, the statements inside the 'default' block are executed.

\begin{itemize}
\item The 'switch' expression is evaluated once
\item The value of the expression is compared with the values of each 'case'
\item If there is a match, the associated block of code is executed
\item The 'break' statement breaks out of the switch block and stops the execution
\item The 'default' statement is optional, and specifies some code to run if there
is no case match.
\end{itemize}

\subsection{Example:}
\label{sec:org0b30693}
\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  char grade = 'B';

  switch (grade) {
  case 'A':
      printf("Excellent!\n");
      break;
  case 'B':
    printf("Good job!\n");
    break;
  case 'C':
    printf("Needs improvement.\n");
    break;
  case 'D':
    printf("Invalid grade.\n");
    break;
  }
  return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
Good job!
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, the program check the value of the 'grade' variable using a
'switch' statement and prints a message depending on the value of 'grade'. If
the value of 'grade' is 'A', the program prints "Excellent!". If the value of
'grade' is 'B', the program prints "Good job!". If the value of 'grade' is 'C',
the program prints "Needs improvement.". If the value of 'grade' is anything
else, the program prints "Invalid grade.".

Note that each case block must end with a 'break' statement. This is because the
'switch' statement will continue to execute the statements in the subsequent
case blocks until it encounters a 'break' statement. The 'default' block is
optional and it is executed if none of the cases match. It is recommended to
always include a 'default' block to handel unexpected cases.

\subsubsection{'Break' keyword:}
\label{sec:orgf4dea88}
When C reaches a break keyword, it breaks out of the switch block.
This will stop the execution of more code and case testing inside the block.
When a match is found and the job is done, it's time for a break. There is no
need for more testing.

Note: a break can save a lot of execution time because it "ignore" the execution
of all the rest of the code in the switch block.
\subsubsection{'Default' keyword:}
\label{sec:orgf1426f4}
The 'default' keyword specifies some code to run if there is no case match:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
    #include <stdio.h>

int main(){
      int day = 4;

      switch (day) {
    case 6:
      printf("Today is Saturday");
      break;
    case 7:
      printf("Today is Sunday");
      break;
    default:
      printf("Looking forward to the Weekend");
  }

  // Outputs "Looking forward to the Weekend"
    }
\end{verbatim}
Output:
\begin{verbatim}
Looking forward to the Weekend
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
Note: The default keyword must be used as the last statement in the switch, and
it does not need a break.

\section{Loops:}
\label{sec:org2d11ee1}
Loops can execute a block of code as long as a specified condition is reached.
Loops are handy because they save time, reduce errors, and they makde code more
readable.

There are 3 types of loops in C: 'for', 'while', and 'do-while'.

\subsection{for Loop:}
\label{sec:org6386143}
The 'for' loops is a control flow statement that repeatedly executes a block of
code as long as a particular condition is true. The syntax is as follows:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
for (initialization; condition; increment/decrement) {
  //statment to be executed
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
The initialization step initializes a loop counter variable and the condition is
evaluated at the beginning of each iteration. If the condition is true, the
statements inside the loop are executed. After executing the statements, the
increment/decrement statement is executed and the condition is evaluated
again. The loop continues until the condition becomes false.

\begin{itemize}
\item Statement 1 is executed (one time) before the execution of the code block.
\item Statement 2 defines the condition for executing the code block.
\item Statement 3 is executed (every time) after the code block has been executed.
\end{itemize}

Here's an example:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  for (int i = 0; i < 10; i++) {
      printf("%d\n", i);
      }
    }
\end{verbatim}
Output:
\begin{verbatim}
0
1
2
3
4
5
6
7
8
9
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
