temp/c-compendium.tex

\subsection{while Loop:}
\label{sec:orgeeb23ee}
\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
while (condition) {
    // statements to be executed
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
The condition is evaluated at the beginning of each iteration. If the condition
is true, the statements inside the loop are executed. After executing the
statements, the condition is evaluated again. The loop continues until the
condition becomes false.
Here's an example:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

  int main(){
	int i = 0;
	while (i < 10) {
	printf("%d\n", i);
	i++;
    }
      }
\end{verbatim}
Output:
\begin{verbatim}
0
1
2
3
4
5
6
7
8
9
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{do-while Loop:}
\label{sec:org94142a7}
The do-while loop is a control flow statement that repeatedly executes a block
of code as long as a particular condition is true. The syntax of the do-while
loop is as follows:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
do {
    // statements to be executed
} while (condition);
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
The statements inside the loop are executed at least once, and then the
condition is evaluated. If the condition is true, the statements inside the loop
are executed again. The loop continues until the condition becomes false.
Here's an example:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

  int main(){
    int i = 0;
    do {
      printf("%d\n", i);
      i++;
    } while (i < 10);
  }
\end{verbatim}
Output:
\begin{verbatim}
0
1
2
3
4
5
6
7
8
9
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
Loops are useful when you need to perform the same operation multiple times, or
when you need to iterate over a collection of data. It's important to make sure
that the loop condition will eventually become false, otherwise the loop will
continue indefinitely, resulting in an infinite loop.

\subsection{Nested Loops:}
\label{sec:org14796c6}
Nested loops in C are loops that are placed inside another loop. This allows you
to perform more complex operations that require multiple iterations.

The basic syntax for a nested loop in C is as follows:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
for (initialization; condition; increment/decrement) {
    for (initialization; condition; increment/decrement) {
	// statements to be executed
    }
}
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, the outer loop controls the iteration of the inner loop. The
statements inside the inner loop will be executed for each iteration of the
outer loop.

Here's an example of a nested loop that prints out a multiplication table:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
  #include <stdio.h>

  int main(){
    for (int i = 1; i <= 10; i++) {
    for (int j = 1; j <= 10; j++) {
	printf("%d ", i*j);
    }
    printf("\n");
}
  }
\end{verbatim}
Output:
\begin{verbatim}
1 2 3 4 5 6 7 8 9 10 
2 4 6 8 10 12 14 16 18 20 
3 6 9 12 15 18 21 24 27 30 
4 8 12 16 20 24 28 32 36 40 
5 10 15 20 25 30 35 40 45 50 
6 12 18 24 30 36 42 48 54 60 
7 14 21 28 35 42 49 56 63 70 
8 16 24 32 40 48 56 64 72 80 
9 18 27 36 45 54 63 72 81 90 
10 20 30 40 50 60 70 80 90 100 
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
It's important to note that nested loops can significantly increase the
execution time of a program, especially if the inner loop is executed many
times. Therefore, it's important to carefully consider whether a nested loop is
the best solution for a particular problem, or if there is a more efficient way
to achieve the same result.










\section{Break and Continue:}
\label{sec:org080a583}
\subsection{Break:}
\label{sec:org6cfaf99}
The 'break' statement is a control statement that is used to exit a loop or
switch statement. When the 'break' statement is encountered the program jumps
out of the loop or switch statement, regardless of whether the loop condition or
switch case condition is still true.

In a previous example the 'break' statement was used to jump out of a 'switch'
statement.

Below is an example of break used to jump out of a for loop where it is used to
jump out when i is equal to 4:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int i;

  for (i = 0; i < 10; i++) {
    if (i == 4) {
      break;
      }
    printf("%d\n", i);
    }
}
\end{verbatim}
Output:
\begin{verbatim}
0
1
2
3
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
Here is an example of using 'break' in a 'switch' statement:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int day = 3;
  switch (day) {
  case 1:
      printf("Monday");
      break;
  case 2:
      printf("Tuesday");
      break;
  case 3:
      printf("Wednesday");
      break;
  default:
    printf("Invalid day");
  }
}
\end{verbatim}
Output:
\begin{verbatim}
Wednesday
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, the switch statement evaluates the value of the variable day,
and executes the appropriate case statement. When day is equal to 3, the code
inside the case 3: block is executed. After the code is executed, the break
statement is encountered, which causes the program to exit the switch statement
and continue with the rest of the program.

In summary, the break statement is a useful tool for controlling the flow of a
program, and can be used to exit loops or switch statements when certain
conditions are met.



\subsection{Continue:}
\label{sec:org0a7cb47}
The 'continue' statement is a control statement that is used to skip the current
iteration of a loop and move on to the next iteration. When the 'continue'
statement is encountered inside a loop, the program skips over any remaining
statements in the loop for that iteration and goes directly to the next
iteration.

Below is an example of using 'continue' in a 'for' loop:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
  #include <stdio.h>

  int main(){
    for (int i = 0; i < 10; i++) {
    if (i % 2 == 0) {
	continue;
    }
    printf("%d\n", i);
}
  }
\end{verbatim}
Output:
\begin{verbatim}
1
3
5
7
9
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, the loop will execute 10 times, with the variable i starting at
0 and increasing by 1 each time through the loop. However, when i is an even
number (i.e., when i \% 2 == 0 is true), the continue statement is executed,
which causes the program to skip over the remaining statements in the loop for
that iteration and move directly to the next iteration. This means that the
printf statement is only executed for odd numbers.


Here's another example of using continue in a while loop:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
  #include <stdio.h>

  int main(){
    int i = 0;
    while (i < 10) {
    i++;
    if (i % 2 == 0) {
	continue;
    }
    printf("%d\n", i);
}
  }
\end{verbatim}
Output:
\begin{verbatim}
1
3
5
7
9
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, the loop will continue to execute as long as i is less
than 10. The variable i is incremented by 1 at the beginning of each
iteration. However, when i is an even number, the continue statement is
executed, which causes the program to skip over the remaining statements in the
loop for that iteration and move directly to the next iteration. This means that
the printf statement is only executed for odd numbers.


In summary, the continue statement is a useful tool for controlling the flow of
a loop, and can be used to skip over certain iterations when certain conditions
are met.
