c-compendium/c-compendium.org
* Arrays:
An array is a collection of elements of the same data type, stored in contiguous
memory locations in C. Each element in the array is accessed using an index,
which is an integer value that represents the position of the element in the
array. The first element in the array has an index of 0, and the last element
has an index of n-1, where n is the size of the array.


Here's an example of creating and accessing an array in C:
-----
#+BEGIN_SRC C :results output
	  #include <stdio.h>

  int main(){
   int numbers[5];   // creates an array of 5 integers

   numbers[0] = 10;  // assigns 10 to the first element of the array
   numbers[1] = 20;  // assigns 20 to the second element of the array
   numbers[2] = 30;  // assigns 30 to the third element of the array
   numbers[3] = 40;  // assigns 40 to the fourth element of the array
   numbers[4] = 50;  // assigns 50 to the fifth element of the array

   printf("%d\n", numbers[2]);   // prints the value of the third element of the array (30)

	  }
  #+END_SRC
Output:
  #+RESULTS:
  : 30
-----
In this example, we create an array of 5 integers called numbers, and assign
values to each element of the array. We then use the index notation numbers[2]
to access the third element of the array, which has a value of 30.


Arrays can also be initialized at the time of creation, like this:
-----
#+BEGIN_SRC C :results output
  int numbers[5] = {10, 20, 30, 40, 50};
  #+END_SRC
-----
In this example, we create an array of 5 integers called numbers and initialize
each element with a value.


Arrays can also be used to represent multi-dimensional data, such as
matrices. In a two-dimensional array, each element is identified by two indices:
a row index and a column index. The elements are stored in row-major order,
meaning that the elements of each row are stored together in contiguous memory
locations.


Here's an example of creating and accessing a two-dimensional array in C:
-----
#+BEGIN_SRC C :results output
    #include <stdio.h>

    int main(){
      int matrix[3][3] = {
      {1, 2, 3},
      {4, 5, 6},
      {7, 8, 9}
  };

  printf("%d\n", matrix[1][2]);  // prints the value of the element in
				 //the second row and third column (6)

    }
  #+END_SRC
Output:
  #+RESULTS:
  : 6
-----
In this example, we create a 3x3 matrix called matrix, and initialize each
element with a value. We then use the index notation matrix[1][2] to access the
element in the second row and third column, which has a value of 6.


Arrays in C are a powerful tool for storing and manipulating collections of data
of the same type, and are widely used in many different programming
applications.

** Change an Array Element:
To change the value of a specific element, refer to the index number:
-----
#+BEGIN_SRC C :results output
  myNumbers[0] = 33;
  #+END_SRC
-----
-----
#+BEGIN_SRC C :results output
    #include <stdio.h>

    int main(){
      int myNumbers[] = {25, 50, 75, 100};
	    myNumbers[0] = 33;

	    printf("%d", myNumbers[0]);

	// Now outputs 33 instead of 25
	  }
  #+END_SRC
Output:
  #+RESULTS:
  : 33
-----

** Loop through an array:
You can loop through the array elements with a 'for' loop.
The following example outputs all elements in the myNumbers array:
-----
#+BEGIN_SRC C :results output
    #include <stdio.h>

    int main(){
      int myNumbers[] = {25, 50, 75, 100};
      int i;

      for (i = 0; i < 4; i++) {
	printf("%d\n", myNumbers[i]);
  }
    }
  #+END_SRC
Output:
  #+RESULTS:
  : 25
  : 50
  : 75
  : 100
-----

* Strings:
A string is a sequence of characters that are stored in an array. A string is
represented as an array of characters terminated by a null character, which is a
character with the ASCII value of 0.

For example, the string "Hello, world!" would be represented in C as an array of
characters:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    char str[] = "Hello, world!";
    printf("%s", str);
  }
  #+END_SRC
Output:
  #+RESULTS:
  : Hello, world!
-----

In the above example 'str' is an array of characters with a size of 14, which
includes the 13 characters of the string plus the null character that terminates
the string.

Strings in C can be manipulated using various standard library functions that
are defind in the 'string.h' header file. Some of the commonly used string
functions include:
- 'strlen()' - Returns the length of a string.
- 'strcpy()' - Copies a string to another string.
- 'strcat()' - Concatenates two strings.
- 'strcmp()' - Compares two strings.

Here is an example of using the 'strlen()' function:
-----
#+BEGIN_SRC C :results output
#include <stdio.h>
#include <string.h>

int main() {
    char str[] = "Hello, world!";
    int length = strlen(str);
    printf("Length of string: %d\n", length);
    return 0;
}
  #+END_SRC
Output:
  #+RESULTS:
  : Length of string: 13
-----
** Modify strings:
To change the value of a specific character in a string, refer to the index
number, and use single quotes:

-----
#+BEGIN_SRC C :results output
	#include <stdio.h>

	int main(){
	  char greetings[] = "Hello World!";
	  greetings[0] = 'J';
	  printf("%s", greetings);
      // Outputs Jello World! instead of Hello World!
	}
  #+END_SRC
Output:
  #+RESULTS:
  : Jello World!
-----
** Loop Through a String:
In the same way you loop through an array, it can be done to loop through a
string:

-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
char carName[] = "Volvo";
int i;

for (i = 0; i < 5; ++i) {
  printf("%c\n", carName[i]);
}
  }
  #+END_SRC
Output:
  #+RESULTS:
  : V
  : o
  : l
  : v
  : o
-----
** Alternate Way of Creating Strings:
In the examples above, we used a "string literal" to create a string
variable. This is the easiest way to create a string in C.


You should also note that you can create a string with a set of characters. This
example will produce the same result as the example in the beginning of this
page:
-----
#+BEGIN_SRC C :results output
char greetings[] = {'H', 'e', 'l', 'l', 'o', ' ', 'W', 'o', 'r', 'l', 'd', '!', '\0'};
printf("%s", greetings);
  #+END_SRC
-----
*Note:* The '\0\ character at the end is known as a "null terminating
character", This tells C that it is the end of the string.

** Special Characters in String:
Because strings must be written within quotes, C will misunderstand this string,
and generate an error:
-----
#+BEGIN_SRC C :results output
char txt[] = "We are the so-called "Vikings" from the north.";
  #+END_SRC
-----
The solution to avoid this problem, is to use the backslash escape character.

The backslash (\) escape character turns special characters into string
characters:
| /                | <      | <            |
|------------------+--------+--------------|
| ESCAPE CHARACTER | RESULT | DESCRIPTION  |
|------------------+--------+--------------|
| \'               | '      | Single quote |
|------------------+--------+--------------|
| \"               | "      | Double quote |
|------------------+--------+--------------|
| \\               | \      | Backslash    |
|------------------+--------+--------------|
| \n               |        | New line     |
|------------------+--------+--------------|
| \t               |        | Tab          |
|------------------+--------+--------------|
| \0               |        | Null         |
|------------------+--------+--------------|

So the correct way to type the above example would be:
-----
#+BEGIN_SRC C :results output
char txt[] = "We are the so-called \"Vikings\" from the north.";
  #+END_SRC
-----
