temp/c-compendium.tex

\section{Arrays:}
\label{sec:orgc4fc6bb}
An array is a collection of elements of the same data type, stored in contiguous
memory locations in C. Each element in the array is accessed using an index,
which is an integer value that represents the position of the element in the
array. The first element in the array has an index of 0, and the last element
has an index of n-1, where n is the size of the array.


Here's an example of creating and accessing an array in C:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
	#include <stdio.h>

int main(){
 int numbers[5];   // creates an array of 5 integers

 numbers[0] = 10;  // assigns 10 to the first element of the array
 numbers[1] = 20;  // assigns 20 to the second element of the array
 numbers[2] = 30;  // assigns 30 to the third element of the array
 numbers[3] = 40;  // assigns 40 to the fourth element of the array
 numbers[4] = 50;  // assigns 50 to the fifth element of the array

 printf("%d\n", numbers[2]);   // prints the value of the third element of the array (30)

	}
\end{verbatim}
Output:
\begin{verbatim}
30
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, we create an array of 5 integers called numbers, and assign
values to each element of the array. We then use the index notation numbers[2]
to access the third element of the array, which has a value of 30.


Arrays can also be initialized at the time of creation, like this:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
int numbers[5] = {10, 20, 30, 40, 50};
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, we create an array of 5 integers called numbers and initialize
each element with a value.


Arrays can also be used to represent multi-dimensional data, such as
matrices. In a two-dimensional array, each element is identified by two indices:
a row index and a column index. The elements are stored in row-major order,
meaning that the elements of each row are stored together in contiguous memory
locations.


Here's an example of creating and accessing a two-dimensional array in C:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
  #include <stdio.h>

  int main(){
    int matrix[3][3] = {
    {1, 2, 3},
    {4, 5, 6},
    {7, 8, 9}
};

printf("%d\n", matrix[1][2]);  // prints the value of the element in
			       //the second row and third column (6)

  }
\end{verbatim}
Output:
\begin{verbatim}
6
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, we create a 3x3 matrix called matrix, and initialize each
element with a value. We then use the index notation matrix[1][2] to access the
element in the second row and third column, which has a value of 6.


Arrays in C are a powerful tool for storing and manipulating collections of data
of the same type, and are widely used in many different programming
applications.

\subsection{Change an Array Element:}
\label{sec:orgaf397eb}
To change the value of a specific element, refer to the index number:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
myNumbers[0] = 33;
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNumbers[] = {25, 50, 75, 100};
	myNumbers[0] = 33;

	printf("%d", myNumbers[0]);

    // Now outputs 33 instead of 25
      }
\end{verbatim}
Output:
\begin{verbatim}
33
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Loop through an array:}
\label{sec:org6232204}
You can loop through the array elements with a 'for' loop.
The following example outputs all elements in the myNumbers array:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
  #include <stdio.h>

  int main(){
    int myNumbers[] = {25, 50, 75, 100};
    int i;

    for (i = 0; i < 4; i++) {
      printf("%d\n", myNumbers[i]);
}
  }
\end{verbatim}
Output:
\begin{verbatim}
25
50
75
100
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\section{Strings:}
\label{sec:org6c4e2f9}
A string is a sequence of characters that are stored in an array. A string is
represented as an array of characters terminated by a null character, which is a
character with the ASCII value of 0.

For example, the string "Hello, world!" would be represented in C as an array of
characters:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  char str[] = "Hello, world!";
  printf("%s", str);
}
\end{verbatim}
Output:
\begin{verbatim}
Hello, world!
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

In the above example 'str' is an array of characters with a size of 14, which
includes the 13 characters of the string plus the null character that terminates
the string.

Strings in C can be manipulated using various standard library functions that
are defind in the 'string.h' header file. Some of the commonly used string
functions include:
\begin{itemize}
\item 'strlen()' - Returns the length of a string.
\item 'strcpy()' - Copies a string to another string.
\item 'strcat()' - Concatenates two strings.
\item 'strcmp()' - Compares two strings.
\end{itemize}

Here is an example of using the 'strlen()' function:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>
#include <string.h>

int main() {
    char str[] = "Hello, world!";
    int length = strlen(str);
    printf("Length of string: %d\n", length);
    return 0;
}
\end{verbatim}
Output:
\begin{verbatim}
Length of string: 13
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\subsection{Modify strings:}
\label{sec:org4407c62}
To change the value of a specific character in a string, refer to the index
number, and use single quotes:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
  #include <stdio.h>

  int main(){
    char greetings[] = "Hello World!";
    greetings[0] = 'J';
    printf("%s", greetings);
// Outputs Jello World! instead of Hello World!
  }
\end{verbatim}
Output:
\begin{verbatim}
Jello World!
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\subsection{Loop Through a String:}
\label{sec:orgc2a93a6}
In the same way you loop through an array, it can be done to loop through a
string:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
  #include <stdio.h>

  int main(){
char carName[] = "Volvo";
int i;

for (i = 0; i < 5; ++i) {
  printf("%c\n", carName[i]);
}
  }
\end{verbatim}
Output:
\begin{verbatim}
V
o
l
v
o
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\subsection{Alternate Way of Creating Strings:}
\label{sec:orgd8a5a95}
In the examples above, we used a "string literal" to create a string
variable. This is the easiest way to create a string in C.


You should also note that you can create a string with a set of characters. This
example will produce the same result as the example in the beginning of this
page:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
char greetings[] = {'H', 'e', 'l', 'l', 'o', ' ', 'W', 'o', 'r', 'l', 'd', '!', '\0'};
printf("%s", greetings);
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\textbf{Note:} The '$\backslash$0$\backslash$ character at the end is known as a "null terminating
character", This tells C that it is the end of the string.

\subsection{Special Characters in String:}
\label{sec:org356ecc2}
Because strings must be written within quotes, C will misunderstand this string,
and generate an error:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
char txt[] = "We are the so-called "Vikings" from the north.";
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
The solution to avoid this problem, is to use the backslash escape character.

The backslash ($\backslash$) escape character turns special characters into string
characters:
\begin{center}
\begin{tabular}{l|l|l}
\hline
ESCAPE CHARACTER & RESULT & DESCRIPTION\\
\hline
$\backslash$' & ' & Single quote\\
\hline
$\backslash$" & " & Double quote\\
\hline
$\backslash$\ & $\backslash$ & Backslash\\
\hline
\n &  & New line\\
\hline
\t &  & Tab\\
\hline
$\backslash$0 &  & Null\\
\hline
\end{tabular}
\end{center}

So the correct way to type the above example would be:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
char txt[] = "We are the so-called \"Vikings\" from the north.";
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
