c-compendium/c-compendium.org
** String functions:
In C, strings are represented as arrays of characters, terminated by a null
character (\0). There are various standard library functions that are defined in
the string.h header file that allow you to manipulate strings. Here are some
commonly used string functions in C:

*** 'strlen()'
Returns the length of a string. This function takes a string as input and
returns the number of characters in the string, excluding the null character.
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>
  #include <string.h>
  
  int main(){
    char str[] = "Hello, world!";
    int len = strlen(str);
    printf("The length of the string is %d\n", len);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The length of the string is 13
-----

*** 'strcpy()'
Copies one string to another. This function takes two strings as input, and
copies the contents of the second string into the first string.

-----
#+BEGIN_SRC C :results output
  #include <stdio.h>
  #include <string.h>

    int main(){
      char src[] = "Hello, world!";
      char dest[20];
      strcpy(dest, src);
      printf("The copied string is %s\n", dest);
      return 0;
    }
  #+END_SRC
Output:
  #+RESULTS:
  : The copied string is Hello, world!
-----
*** 'strcat()'
Concatenates two strings. This function takes two strings as input, and appends
the contents of the second string to the end of the first string.
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>
  #include <string.h>
  
  int main(){
    char str1[20] = "Hello, ";
    char str2[] = "world!";
    strcat(str1, str2);
    printf("The concatenated string is %s\n", str1);
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The concatenated string is Hello, world!
-----
*** 'strcmp()'
Compares two strings. This function takes two strings as input and returns an
integer value that indicates the lexicographic relationship between the two
strings.
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>
  #include <string.h>

  int main(){
    char str1[] = "Hello, world!";
    char str2[] = "Hello, World!";
    int cmp = strcmp(str1, str2);
    if(cmp == 0) {
      printf("The strings are equal\n");
      } else if(cmp < 0) {
      printf("The first string is less than the second string\n");
      } else {
      printf("The first string is greater than the second string\n");
      }
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The first string is greater than the second string
-----
These are just a few of the many string functions available in C, It's important
to read the documentation carefully to understand how to use each function
correctly.

* User Input:
In C, you can read user input from the keyboard using the scanf() function. This
function reads input from the standard input stream (stdin) and stores the
values in variables.


Here is an example of how to use scanf() to read a single integer from the user:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
      int num;
    printf("Enter a number: ");
    scanf("%d", &num);
    printf("You entered: %d\n", num);
    return 0;
  }
  #+END_SRC
-----
In this example, the printf() function is used to prompt the user to enter a
number, and the scanf() function is used to read the number from the keyboard
and store it in the num variable. The format specifier %d tells scanf() to read
an integer value, and the & operator is used to pass the address of the variable
num to scanf().


Here is an example of how to use scanf() to read multiple values from the user:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int num1, num2;
    printf("Enter two numbers: ");
    scanf("%d %d", &num1, &num2);
    printf("You entered: %d and %d\n", num1, num2);
    return 0;
  }
  #+END_SRC
-----
In this example, the scanf() function is used to read two integer values
separated by a space. The values are stored in the variables num1 and num2,
respectively.

Note that scanf() can be tricky to use correctly, especially when reading
strings or other types of data that require more complex input formatting.

'scanf()' has some serious limitations regarding strings. One being that it
considers space (whitespace, tabs, etc) as terminating characters, which means
that it will only display a single word (even if you input many words).
That is why when working with strings it is at times better to use 'fgets()' to
read a line of text. Note that you must include the following arguments:
- name of the string variable
- sizeof (string_name)
- stdin

* Memory Address:
In C, memory addresses are used to refer to specific locations in the computer's
memory. Every variable declared in a C program has a memory address associated
with it. You can think of a memory address as a unique identifier that tells the
program where a particular value is stored in memory.
When a variable is created in C, a memory address is assigned to the variable.
The memory address is the location of where the variable is stored on the computer.
When we assign a value to the variable, it is stored in this memory address.

Memory addresses are represented as hexadecimal numbers in C. For example, the
memory address of a variable called x can be obtained using the & operator, like
this:
-----
#+BEGIN_SRC C :results output
      #include <stdio.h>

      int main(){
	int x = 42;
	printf("The address of x is: %p\n", &x);
      }
  #+END_SRC
Output:
  #+RESULTS:
  : The address of x is: 0x7ffd2d641154
-----
In this example, the %p format specifier is used to print the memory address of
x in hexadecimal format. The & operator is used to obtain the address of x and
pass it to printf().


You can also use pointers in C to work with memory addresses directly. A pointer
is a variable that stores the memory address of another variable. Here is an
example of how to declare a pointer and initialize it with the address of a
variable:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int x = 42;
    int *ptr = &x;
    printf("The value of x is: %d\n", *ptr);
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The value of x is: 42
-----
In this example, the * operator is used to declare ptr as a pointer to an
integer. The address of x is obtained using the & operator and stored in ptr.

You can use pointers to access the value stored at a particular memory
address. The * operator is used to dereference a pointer and obtain the value
stored at the memory address it points to.

In this example, the * operator is used to dereference ptr and obtain the value
stored at the memory address it points to. The output of the printf() statement
will be The value of x is: 42.

Working with memory addresses and pointers can be tricky and requires a good
understanding of how memory works in the computer. It's important to be careful
when working with memory addresses and avoid common errors like dereferencing a
null pointer or accessing memory that is out of bounds.

** Why is it useful to know the memory address?
*Pointers* are important in C, because they allow us to manipulate the data in
the computer's memory - this can reduce the code and improve the performance.

Pointers are one of the things that makes C stand out from other programming
languages.

