c-compendium/c-compendium.org
* Pointers:
In the previous section pointers were briefly mentioned with regards to memory
addresses.

A pointer is a variable that stores the memory address of another
variable. Pointers provide a way to work with memory addresses and access the
values stored at those addresses directly.

To declare a pointer variable, you use the * operator in the variable
declaration. For example, to declare a pointer to an integer variable x, you
would use the following syntax:
-----
#+BEGIN_SRC C :results output
  int *prt;
  #+END_SRC
-----
This declares a pointer variable called ptr that can store the memory address of
an integer value. The * operator is used to indicate that ptr is a pointer
variable.

To initialize a pointer variable with the memory address of a variable, you use
the & operator. For example, to initialize ptr with the memory address of x, you
would use the following syntax:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int x = 42;
    int *ptr = &x;
    printf("The value of x is: %d\n", *ptr);
  }
  #+END_SRC
Output:
  #+RESULTS:
  : The value of x is: 42
-----
This initializes ptr with the memory address of x. The & operator is used to
obtain the memory address of x, which is then assigned to ptr.

To access the value stored at the memory address pointed to by a pointer
variable, you use the * operator again.

This dereferences ptr using the * operator and prints the value stored at the
memory address pointed to by ptr, which is the value stored in x.

Pointers can be used for a wide variety of purposes in C, including dynamic
memory allocation, working with arrays, and passing variables to functions by
reference. However, working with pointers requires a good understanding of
memory management and can be error-prone if not done carefully.

** Dereference:
Note that the * sign can be confusing here, as it does two different things in our code:

When used in declaration (int* ptr), it creates a pointer variable.
When not used in declaration, it act as a dereference operator.
Good To Know: There are two ways to declare pointer variables in C:
-----
#+BEGIN_SRC C :results output
  int* myNum;
  int *myNum;
  #+END_SRC
-----
Pointers are one of the things that make C stand out from other programming
languages, like Python and Java.

They are important in C, because they allow us to manipulate the data in the
computer's memory. This can reduce the code and improve the performance. If you
are familiar with data structures like lists, trees and graphs, you should know
that pointers are especially useful for implementing those. And sometimes you
even have to use pointers, for example when working with files.

But be careful; pointers must be handled with care, since it is possible to
damage data stored in other memory addresses.

* Pointers and Arrays:
You can also use pointers to access arrays.
Consider the following array of integers:
-----
#+BEGIN_SRC C :results output
int myNumbers[4] = {25, 50, 75, 100};
#+END_SRC
-----
Loop through the array elements with a for loop:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myNumbers[4] = {25, 50, 75, 100};
    int i;

    for (i = 0; i < 4; i++) {
      printf("%d\n", myNumbers[i]);
    }
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 25
  : 50
  : 75
  : 100
-----
Now instead of printing the value of each array element, print the memory
address of each array element:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myNumbers[4] = {25, 50 , 75, 100};
    int i;

  for (i = 0; i < 4; i++) {
    printf("%p\n", &myNumbers[i]);
  }
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 0x7ffc285a9830
  : 0x7ffc285a9834
  : 0x7ffc285a9838
  : 0x7ffc285a983c
-----
Note that the last number of each elements' memory is address is different, with
an addition of 4.
This is due to the size of an 'int' type being typically 4 bytes.
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myInt;

  printf("%lu", sizeof(myInt));
   
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 4
-----
From the memory address example above you can see that the compiler reserves 4
bytes of memory for each array, element, which means that the entire array takes
up 16 bytes (4*4) of memory storage:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myNumbers[4] = {25, 50, 75, 100};

    printf("%lu", sizeof(myNumbers));
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 16
-----
** How are pointers related to arrays:
The name of an array is actually a pointer to the first element of the array.
See in the example below that the memory address of the first element is the
same as the name of the array:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myNumbers[4] = {25, 50, 75, 100};

    printf("%p\n", myNumbers);
    printf("%p\n", &myNumbers[0]);
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 0x7ffcd8fd0b30
  : 0x7ffcd8fd0b30
-----
This shows that it is possible to work with arrays through pointers.
Since myNumbers is a pointer to the first element in myNumbers you can use the *
operator to access it.
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myNumbers[4] = {25, 50, 75, 100};

    //Get the value of the fist element in myNumbers
    printf("%d\n", *myNumbers);

    //Get the value of the second element in myNumbers
    printf("%d\n", *(myNumbers + 1));

    //Get the value of the third element in myNumbers
    printf("%d\n", *(myNumbers + 2));

    //Get the value of the fourth element in myNumbers
    printf("%d\n", *(myNumbers + 3));
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 25
  : 50
  : 75
  : 100
-----
Or loop through the array:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myNumbers[4] = {25, 50, 75, 100};
    int *ptr = myNumbers;
    int i;

    for (i = 0; i < 4; i++) {
      printf("%d\n", *(ptr + i));
      }
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 25
  : 50
  : 75
  : 100
-----
It is also possible to change the value of array elements with pointers:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  int main(){
    int myNumbers[4] = {25, 50, 75, 100};
    //Change the value of the first element to 13
    ,*myNumbers = 13;

    //Change the value of the second element to 17
    ,*(myNumbers + 1) = 17;

    //Print value of the first element
    printf("%d\n", *myNumbers);

    //Get the value of the second element
    printf("%d\n", *(myNumbers + 1));
  }
  #+END_SRC
Output:
  #+RESULTS:
  : 13
  : 17
-----
This way of working with arrays might seem a bit excessive. Especially with
simple arrays like in the examples above. However, for large arrays, it can be
much more efficient to access and manipulate arrays with pointers.

It is also considered faster and easier to access two-dimensional arrays with
pointers.

And since strings are actually arrays, you can also use pointers to access
strings.

