temp/c-compendium.tex

\section{Pointers:}
\label{sec:org4c7a62f}
In the previous section pointers were briefly mentioned with regards to memory
addresses.

A pointer is a variable that stores the memory address of another
variable. Pointers provide a way to work with memory addresses and access the
values stored at those addresses directly.

To declare a pointer variable, you use the * operator in the variable
declaration. For example, to declare a pointer to an integer variable x, you
would use the following syntax:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
int *prt;
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
This declares a pointer variable called ptr that can store the memory address of
an integer value. The * operator is used to indicate that ptr is a pointer
variable.

To initialize a pointer variable with the memory address of a variable, you use
the \& operator. For example, to initialize ptr with the memory address of x, you
would use the following syntax:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int x = 42;
  int *ptr = &x;
  printf("The value of x is: %d\n", *ptr);
}
\end{verbatim}
Output:
\begin{verbatim}
The value of x is: 42
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
This initializes ptr with the memory address of x. The \& operator is used to
obtain the memory address of x, which is then assigned to ptr.

To access the value stored at the memory address pointed to by a pointer
variable, you use the * operator again.

This dereferences ptr using the * operator and prints the value stored at the
memory address pointed to by ptr, which is the value stored in x.

Pointers can be used for a wide variety of purposes in C, including dynamic
memory allocation, working with arrays, and passing variables to functions by
reference. However, working with pointers requires a good understanding of
memory management and can be error-prone if not done carefully.

\subsection{Dereference:}
\label{sec:orgba50c1d}
Note that the * sign can be confusing here, as it does two different things in our code:

When used in declaration (int* ptr), it creates a pointer variable.
When not used in declaration, it act as a dereference operator.
Good To Know: There are two ways to declare pointer variables in C:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
int* myNum;
int *myNum;
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
Pointers are one of the things that make C stand out from other programming
languages, like Python and Java.

They are important in C, because they allow us to manipulate the data in the
computer's memory. This can reduce the code and improve the performance. If you
are familiar with data structures like lists, trees and graphs, you should know
that pointers are especially useful for implementing those. And sometimes you
even have to use pointers, for example when working with files.

But be careful; pointers must be handled with care, since it is possible to
damage data stored in other memory addresses.

\section{Pointers and Arrays:}
\label{sec:orge476bee}
You can also use pointers to access arrays.
Consider the following array of integers:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
int myNumbers[4] = {25, 50, 75, 100};
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
Loop through the array elements with a for loop:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNumbers[4] = {25, 50, 75, 100};
  int i;

  for (i = 0; i < 4; i++) {
    printf("%d\n", myNumbers[i]);
  }
}
\end{verbatim}
Output:
\begin{verbatim}
25
50
75
100
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
Now instead of printing the value of each array element, print the memory
address of each array element:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNumbers[4] = {25, 50 , 75, 100};
  int i;

for (i = 0; i < 4; i++) {
  printf("%p\n", &myNumbers[i]);
}
}
\end{verbatim}
Output:
\begin{verbatim}
0x7ffc285a9830
0x7ffc285a9834
0x7ffc285a9838
0x7ffc285a983c
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
Note that the last number of each elements' memory is address is different, with
an addition of 4.
This is due to the size of an 'int' type being typically 4 bytes.

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myInt;

printf("%lu", sizeof(myInt));

}
\end{verbatim}
Output:
\begin{verbatim}
4
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
From the memory address example above you can see that the compiler reserves 4
bytes of memory for each array, element, which means that the entire array takes
up 16 bytes (4*4) of memory storage:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNumbers[4] = {25, 50, 75, 100};

  printf("%lu", sizeof(myNumbers));
}
\end{verbatim}
Output:
\begin{verbatim}
16
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\subsection{How are pointers related to arrays:}
\label{sec:orgc4b0050}
The name of an array is actually a pointer to the first element of the array.
See in the example below that the memory address of the first element is the
same as the name of the array:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNumbers[4] = {25, 50, 75, 100};

  printf("%p\n", myNumbers);
  printf("%p\n", &myNumbers[0]);
}
\end{verbatim}
Output:
\begin{verbatim}
0x7ffcd8fd0b30
0x7ffcd8fd0b30
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
This shows that it is possible to work with arrays through pointers.
Since myNumbers is a pointer to the first element in myNumbers you can use the *
operator to access it.

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNumbers[4] = {25, 50, 75, 100};

  //Get the value of the fist element in myNumbers
  printf("%d\n", *myNumbers);

  //Get the value of the second element in myNumbers
  printf("%d\n", *(myNumbers + 1));

  //Get the value of the third element in myNumbers
  printf("%d\n", *(myNumbers + 2));

  //Get the value of the fourth element in myNumbers
  printf("%d\n", *(myNumbers + 3));
}
\end{verbatim}
Output:
\begin{verbatim}
25
50
75
100
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
Or loop through the array:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNumbers[4] = {25, 50, 75, 100};
  int *ptr = myNumbers;
  int i;

  for (i = 0; i < 4; i++) {
    printf("%d\n", *(ptr + i));
    }
}
\end{verbatim}
Output:
\begin{verbatim}
25
50
75
100
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
It is also possible to change the value of array elements with pointers:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int main(){
  int myNumbers[4] = {25, 50, 75, 100};
  //Change the value of the first element to 13
  *myNumbers = 13;

  //Change the value of the second element to 17
  *(myNumbers + 1) = 17;

  //Print value of the first element
  printf("%d\n", *myNumbers);

  //Get the value of the second element
  printf("%d\n", *(myNumbers + 1));
}
\end{verbatim}
Output:
\begin{verbatim}
13
17
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
This way of working with arrays might seem a bit excessive. Especially with
simple arrays like in the examples above. However, for large arrays, it can be
much more efficient to access and manipulate arrays with pointers.

It is also considered faster and easier to access two-dimensional arrays with
pointers.

And since strings are actually arrays, you can also use pointers to access
strings.
