c-compendium/c-compendium.org
* Functions:
A function is a block of code which only runs when it is called.
You can pass data known as parameters into a function. Functions are used to
perform certain actions, and they are important for reusing code: Define the
code once and use it many times.
Functions are essentially used to break down a large program into smaller,
manageable parts.
Functions in C have the following characteristics:
1. A function is defined using the "function" keywrod followed by the return
   type, function name, and parameters (if any) in parentheses.
2. The code insude the function is enclosed in curly braces {}.
3. A function can have zero or more parameters, which are used to pass data to
   the function.
4. A function can have a return type, which indicates the type of data the
   function will return when it completes its task.
5. When a function is called, control  is transferred to the function, and the
   code inside the function is executed. After the function completes it's task,
   control is returned to the calling function.
6. Functions can be called from other functions, or from the main program.

   Below is an example of a simple function in C:
   -----
   #+BEGIN_SRC C :results output
     #include <stdio.h>

     int square(int num) {
       int result;
       result = num * num;
       return result;
       }

     int main(){
       int num = 5;
       int sqr;
       sqr = square(num);
       printf("The square of %d is %d\n", num, sqr);
       return 0;
     }
     #+END_SRC
Output:
     #+RESULTS:
     : The square of 5 is 25
-----
In this example, the "square" function takes an integer parameter "num",
calculates the square of "num", and returns the result. The "main" function
calls the "square" function, passing it the value 5. The returned result is then
assigned to the "sqr" variable, which is then printed to the console using the
printf function.

Functions are an essential part of C programming, allowing you to break down
complex programs into smaller, more manageable parts.

** Create a function:
To create (often referred to as declare) a function, specify the name of the
function followed by parentheses() and curly brackets {}:
-----
#+BEGIN_SRC C :results output
  void myFunction(){
    //code to be executed
  }
  #+END_SRC
-----
** Call a function:
Declared functions are not executed immediatley. They are "saved for later use"
and will be executed when they are called.
To call a function, write the functions name followed by two parenthese () and a
semicolon ;
The following example shows how myFunction() is to print text when it's called:
-----
#+BEGIN_SRC C :results output
    #include <stdio.h>


  //Create function
  void myFunction() {
	printf("I just got executed!");
      }
  int main() {
    myFunction(); //call  function (off with his head!)
    return 0;
  }  

  #+END_SRC
Output:
  #+RESULTS:
  : I just got executed!
-----
A function can be called multiple times:
-----
#+BEGIN_SRC C :results output
  #include <stdio.h>

  void myFunction() {
    printf("I just got executed!");
  }

  int main(){
    myFunction();
    myFunction();
    myFunction();
    return 0;
  }
  #+END_SRC
Output:
  #+RESULTS:
  : I just got executed!I just got executed!I just got executed!
-----



























\clearpage
* Footnotes:
[fn:1] Operand: a term used to refer to a value or a variable that is operated
on by an operator.
[fn:2]Operator is a symbol that performs some operation on one
or more operands to produce a result.


