temp/c-compendium.tex

\section{Functions:}
\label{sec:orgcf10486}
A function is a block of code which only runs when it is called.
You can pass data known as parameters into a function. Functions are used to
perform certain actions, and they are important for reusing code: Define the
code once and use it many times.
Functions are essentially used to break down a large program into smaller,
manageable parts.
Functions in C have the following characteristics:
\begin{enumerate}
\item A function is defined using the "function" keywrod followed by the return
type, function name, and parameters (if any) in parentheses.
\item The code insude the function is enclosed in curly braces \{\}.
\item A function can have zero or more parameters, which are used to pass data to
the function.
\item A function can have a return type, which indicates the type of data the
function will return when it completes its task.
\item When a function is called, control  is transferred to the function, and the
code inside the function is executed. After the function completes it's task,
control is returned to the calling function.
\item Functions can be called from other functions, or from the main program.

Below is an example of a simple function in C:

\noindent\rule{\textwidth}{0.5pt}
\begin{verbatim}
#include <stdio.h>

int square(int num) {
  int result;
  result = num * num;
  return result;
  }

int main(){
  int num = 5;
  int sqr;
  sqr = square(num);
  printf("The square of %d is %d\n", num, sqr);
  return 0;
}
\end{verbatim}
\end{enumerate}
Output:
\begin{verbatim}
The square of 5 is 25
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
In this example, the "square" function takes an integer parameter "num",
calculates the square of "num", and returns the result. The "main" function
calls the "square" function, passing it the value 5. The returned result is then
assigned to the "sqr" variable, which is then printed to the console using the
printf function.

Functions are an essential part of C programming, allowing you to break down
complex programs into smaller, more manageable parts.






























\clearpage
\section{Footnotes:}
\label{sec:org4d521f3}
\end{document}